[
  {},
  {
    "id": "13184",
    "title": "Ground Grass-fed Wagyu Beef",
    "description": "Wagyu beef (aka “Kobe” beef) is from a breed of cow specially raised to increase its  percentage of fat marbling to consistently high levels. More marbling leads to more flavor, tenderness,  and moisture as the fat melts during the cooking process. Thus, ground wagyu beef is more flavorful and  moist than conventional beef. <br /> <br />Grass-fed wagyu beef is almost unheard of in the  beef market.&amp;nbsp; Hapani Wagyu Beef is free range (pasture raised) and 100% grass-fed/finished.&amp;nbsp;  No hormones or antibiotics are ever used to promote growth.&amp;nbsp; Despite being raised without  grain, it is still exquisitely marbled and produces fantastic ground beef. <br /> <br />Use  this ground beef to make truly luxurious meals.&amp;nbsp; Its higher fat content will help ensure formed  items like burgers, meatloaf &amp;amp; meatballs stay together and stay moist. <br /> <br />Not  only is free range grass fed beef more humane, it’s better for you too.&amp;nbsp; 100% grass fed beef is  lower in saturated fat as well as higher in valuable nutrients like vitamins A &amp;amp; E, conjugated  linoleic acid (aka CLA), and omega-3 fatty acids.<br /> <br /> ",
    "link": "https://www.marxfoods.com/Ground-Grass-fed-Wagyu-Beef",
    "image_link": "https://www.marxfoods.com/images/Ground-Grass-fed-Wagyu-Beef_GroundGrass-fedWagyuBeef-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "13085",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25218",
    "title": "Wagyu Beef New York Strip Steaks",
    "description": "NY strip steaks (aka country club steaks, ambassador steaks) are perhaps the most iconic  steak-house cut, offering tender beef and a perfect showcase for traditional steak sauces. Strip steaks  cut from Kobe beef take this meaty favorite to a new level by adding extra flavor and tenderness.<br  /> <br />This wagyu beef (commonly known as &quot;Kobe beef&quot;, aka Kobe-style beef  or Australian Kobe beef) is from Waygu cattle that are descendents from Japanese herds and raised in  Australia. Their intricately marbled beef is legendary and the result of careful breeding and a highly  regimented diet. That marbling creates beef that is the most tender, juicy, and flavorful available.<br  /><br /> ",
    "link": "https://www.marxfoods.com/Kobe-Strip-Steaks",
    "image_link": "https://www.marxfoods.com/images/Kobe-Strip-Steaks_WagyuNYStripSteaks-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2397",
    "shipping_weight": "1 lb"
  },
  {
    "id": "7510",
    "title": "Wagyu Bone-In Short Ribs",
    "description": "Wagyu&amp;nbsp;short ribs (aka&amp;nbsp;Kobe beef&amp;nbsp;short ribs) are an affordable,  meaty and well marbled cut high in collagen. When braised, this collagen (along with the marbled fat and  gelatin from the bones) melts into the braising liquid, resulting in incredibly tender meat and a rich  sauce. <br /><br />Some people prefer the bone-in cut because they believe the bones offer  additional flavor, help stabilize the meat during cooking so it doesn’t fall apart, and offer a more  interesting look on the plate. Others feel that Kobe boneless short ribs are easier to eat, although the  bones can be easily removed from this cut after cooking for a similar result.<br /><br />This&amp;nbsp;wagyu  beef (commonly known as &quot;Kobe beef&quot;, aka Kobe-style beef or American Kobe beef) is from  domestic Waygu (meaning &quot;Beef of Japan&quot;) cattle that are descendants from Japanese herds and  raised in the United States. Their intricately marbled beef is legendary and the result of careful  breeding and a highly regimented diet. That marbling creates beef that is the most tender, juicy, and  flavorful available.<br /><br /> ",
    "link": "https://www.marxfoods.com/Kobe-Beef-Short-Ribs",
    "image_link": "https://www.marxfoods.com/images/Kobe-Beef-Short-Ribs_WagyuBeefBone-InShortRibs-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2397",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4059",
    "title": "Wagyu Beef Boneless Short Ribs",
    "description": "Many people like boneless short ribs better than bone-in short ribs because they feel they  are easier to eat. Others prefer bone-in Kobe short ribs because they feel the bones keep the meat  together during cooking and impart extra flavor. <br /> <br />This wagyu beef is from  domestic cattle that are descendants from Japanese herds and raised in the United States. Their  intricately marbled beef (commonly known as &quot;Kobe beef&quot;, American Kobe beef or Kobe-style  beef) is legendary and the result of careful breeding and a highly regimented diet. That marbling  creates beef that is the most tender, juicy, and flavorful available. <br /><br /> ",
    "link": "https://www.marxfoods.com/Kobe-Boneless-Short-Ribs",
    "image_link": "https://www.marxfoods.com/images/Kobe-Boneless-Short-Ribs_WagyuBeefBonelessShortRibs-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2397",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25215",
    "title": "Wagyu Beef Ribeye Steaks",
    "description": "Ribeye steaks are the quintessential high end steak, renowned for their intensely beefy  flavor. This cut is a particularly striking showcase of wagyu beef&#x27;s extreme marbling, with high  grade examples practically melting in the mouth.<br /> <br />This wagyu beef (aka kobe-style  beef) is from a breed of cattle descended from Japanese herds and specially raised in Texas to increase  its percentage of fat marbling to consistently high levels. More marbling leads to more flavor,  tenderness, and moisture as the fat melts during the cooking process. Thus, wagyu beef ribeye steaks are  both more flavorful and more tender than those cut from conventional beef.<br /><br /> ",
    "link": "https://www.marxfoods.com/Kobe-Ribeye-Steaks-1",
    "image_link": "https://www.marxfoods.com/images/Kobe-Ribeye-Steaks-1_KobeRibeyeSteaks-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2397",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26270",
    "title": "Wagyu Inner Skirt Steaks",
    "description": "Skirt steaks have a chewy texture that makes them less popular than the steakhouse cuts.  However, this simply makes them more affordable, and they actually offer some of the richest flavor of  all steaks. Their loose texture makes them particularly well suited to absorbing marinades. <br /><br  />Inner skirt steaks are the traditional cut used in making fajitas.<br /><br />These wagyu  skirt steaks are inner skirt steaks rather than outer skirt steaks.  Most chefs prefer inner skirt  steaks because they require much less trimming before cooking.  In addition, they have already been  peeled (had the outer membrane removed), so they’re ready to cook.<br /><br />They are from  domestic waygu cattle that are descendants from Japanese herds and raised in the United States. Wagyu  cattle’s intricately marbled beef (commonly known as Kobe beef, aka American Kobe beef or Kobe-style  beef) is legendary and the result of careful breeding and a highly regimented diet. That marbling  creates beef that is the most tender, juicy, and flavorful available.<br /><br /> ",
    "link": "https://www.marxfoods.com/Kobe-Beef-Skirt-Steaks_2",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2397",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25235",
    "title": "Grass-fed Beef Flank Steaks",
    "description": "The flank steak is a long, thin, flat cut that absorbs marinades extremely well. It has a  bold, beefy flavor and a more chewy texture. It is most often cooked hot and fast using dry heat methods  like grilling or broiling. Though skirt steaks are the traditional cut used for fajitas, you could also  use flank steaks. <br /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern  Farms Angus beef is 100% grass-fed &amp;amp; finished, raised free range on massive, pristine pastures  in New Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal there.<br  /> <br />Because of New Zealand&#x27;s moderate climate, these cattle are pasture raised year  round, with free access to windbreaks and other structures for shelter from inclement weather.<br />  <br />Selected for Excellence<br /> Silver Fern Farms is a coop of small family farmers  across New Zealand. The Angus program combines the Angus breed, renowned for superior marbling, flavor,  and texture, with a grading system that ensures you get great beef every time. It has a clean, boldly  beefy flavor without the heavy tallow characteristic of commodity beef. <br /> <br />Careful  quality grading ensures it is consistently more marbled, tender, and flavorful than much of the  grass-fed beef available in the US.(more...) ",
    "link": "https://www.marxfoods.com/Grass-fed-Beef-Flank-Steaks",
    "image_link": "https://www.marxfoods.com/images/Grass-fed-Beef-Flank-Steaks_Grass-FedBeefFlankSteaks-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23572",
    "shipping_weight": "1 lb"
  },
  {
    "id": "23479",
    "title": "Grass-Fed Beef Chuck Rolls",
    "description": "The chuck roll (aka boneless neck) is a deboned portion of the neck located in the Chuck  primal that offers good flavor, but typically needs to be braised, stewed, or ground in order to become  tender.<br /> <br />There is a smaller muscle located within the chuck roll, known as the  chuck eye roll, which can be separated using seam butchery techniques and is tender enough for slow  roasting.<br /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern Farms Angus  beef is 100% grass-fed &amp;amp; finished, raised free range on massive, pristine pastures in New  Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal there.<br />  <br />Because of New Zealand&#x27;s moderate climate, these cattle are pasture raised year round,  with free access to windbreaks and other structures for shelter from inclement weather.<br /> <br  />Selected for Excellence<br /> Silver Fern Farms is a coop of small family farmers across New  Zealand. The Angus program combines the Angus breed, renowned for superior marbling, flavor, and  texture, with a grading system that ensures you get great beef every time. It has a clean, boldly beefy  flavor without the heavy tallow characteristic of commodity beef. <br /> <br />Careful  quality grading ensures it is consistently more marbled,(more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Beef-Chuck-Rolls",
    "image_link": "https://www.marxfoods.com/images/Grass-Fed-Beef-Chuck-Rolls_GrassFedBeefChuckRolls-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "12365",
    "title": "Grass-Fed Beef Whole Flat Irons",
    "description": "The flat iron (aka top blade, top chuck, oyster blade) is a special cut from the shoulder  that offers surprisingly good flavor and tenderness at a great price. <br /><br />What makes  this cut so affordable is that it requires a little butchery work before it can be cooked.  A layer of  tough silverskin runs through the center of the flat iron, separating two sections of tender meat.  If  you&#x27;re willing to do the butchery yourself (see the Recipes &amp;amp; Tips tab for a video guide),  you can have flat iron steaks at a superb price.<br /><br />Pre-cut, ready to cook flat iron  steaks are also available, saving you all the work.<br /> <br />Grass Fed &amp;amp; Pasture  Raised<br /> Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished, raised free range  on massive, pristine pastures in New Zealand. No hormone or antibiotic growth promotants are ever used,  and GMOs are illegal there.<br /> <br />Because of New Zealand&#x27;s moderate climate,  these cattle are pasture raised year round, with free access to windbreaks and other structures for  shelter from inclement weather.<br /> <br />Selected for Excellence<br /> Silver Fern  Farms is a coop of small family farmers across New Zealand. The Angus program combines the Angus breed,  renowned for superior marbling, flavor, and texture,(more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Beef-Flat-Irons",
    "image_link": "https://www.marxfoods.com/images/Grass-Fed-Beef-Flat-Irons_Grass-FedBeefWholeFlatIrons-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25234",
    "title": "Grass-fed Beef Top Round",
    "description": "The economical top round cut is also very versatile. While it can be cut into steaks (called  top round steaks or round steaks), it works extremely well in moist heat applications like stews,  pot-roasts, and braised dishes. The Japanese often slice the top round extremely thin for use in  simmered dishes like sukiyaki and shabu-shabu. It takes marinades well and can also be cooked whole for  roast beef.<br /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern Farms  Angus beef is 100% grass-fed &amp;amp; finished, raised free range on massive, pristine pastures in New  Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal there.<br />  <br />Because of New Zealand&#x27;s moderate climate, these cattle are pasture raised year round,  with free access to windbreaks and other structures for shelter from inclement weather.<br /> <br  />Selected for Excellence<br /> Silver Fern Farms is a coop of small family farmers across New  Zealand. The Angus program combines the Angus breed, renowned for superior marbling, flavor, and  texture, with a grading system that ensures you get great beef every time. It has a clean, boldly beefy  flavor without the heavy tallow characteristic of commodity beef. <br /> <br />Careful  quality grading ensures it is consistently mo(more...) ",
    "link": "https://www.marxfoods.com/Grass-fed-Beef-Top-Rounds",
    "image_link": "https://www.marxfoods.com/images/Grass-fed-Beef-Top-Rounds_GrassfedBeefTopRounds-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23572",
    "shipping_weight": "1 lb"
  },
  {
    "id": "12144",
    "title": "Grass-Fed Beef Teres Majors",
    "description": "The teres major (aka teras major,&amp;nbsp;petite tender, shoulder tender) is a&amp;nbsp;relatively&amp;nbsp;unheard  of, but highly desirable cut.&amp;nbsp; Believe it or not, this muscle&amp;nbsp;may be&amp;nbsp;the  second most tender cut after the tenderloin.<br /> <br />The reason why this is a  comparatively “new” cut is that until recently it required a high level of butchery skill and experience  to extract from the tougher shoulder muscles around it.&amp;nbsp; Now that a better process has been  discovered, it is rapidly gaining popularity because it provides a more affordable alternative to the  prized tenderloin.<br /> <br />Not only do teres majors have a taste and texture similar to  tenderloins, they’re similarly easy to cook.&amp;nbsp; You can either roast them whole or slice them&amp;nbsp;into  medallions for sautéing or pan roasting.<br /> <br />Grass Fed &amp;amp; Pasture Raised<br  /> Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished, raised free range on massive,  pristine pastures in New Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are  illegal there.<br /> <br />Because of New Zealand&#x27;s moderate climate, these cattle are  pasture raised year round, with free access to windbreaks and other structures for shelter from  inclement weather.<br /> <br />Sele(more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Teres-Majors",
    "image_link": "https://www.marxfoods.com/images/Grass-Fed-Teres-Majors_Grass-FedBeefTeresMajors-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "23480",
    "title": "Grass-Fed Beef Coulottes",
    "description": "The coulotte (aka round sirloin tip, sirloin cap, or rump cap) is not a familiar cut to most  Americans, but is worth discovering. It is cut from the top portion or “cap” of the sirloin.<br />  <br />The most marbled part of the sirloin, with a coarse structure, coulotte is surprisingly  tender and flavorful. It is great grilled or roasted (where its fat cap will self-baste the meat,  helping to keep it moist) and is particularly prized in Brazilian barbecue (where it is known as the  picanha).<br /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern Farms Angus  beef is 100% grass-fed &amp;amp; finished, raised free range on massive, pristine pastures in New  Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal there.<br />  <br />Because of New Zealand&#x27;s moderate climate, these cattle are pasture raised year round,  with free access to windbreaks and other structures for shelter from inclement weather.<br /> <br  />Selected for Excellence<br /> Silver Fern Farms is a coop of small family farmers across New  Zealand. The Angus program combines the Angus breed, renowned for superior marbling, flavor, and  texture, with a grading system that ensures you get great beef every time. It has a clean, boldly beefy  flavor without the heavy tallow chara(more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Beef-Coulottes",
    "image_link": "https://www.marxfoods.com/images/Grass-Fed-Beef-Coulottes_GrassFedBeefCoulottes-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25237",
    "title": "Grass-fed Beef Top Sirloin",
    "description": "Center cut top sirloin (aka roast biff, center-cut top sirloin heart, top sirloin butt, ball  tip, rump heart) is the large cut that top sirloin steaks are usually cut from. In its larger form it  can be cut into sirloin steaks, cut into strips or cubes for various grilling applications, or roasted  whole.<br /> <br />Though perhaps not as extremely tender as tenderloins or striploins, the  top sirloin is still tender enough to make wonderful steaks. It also offers great flavor at a much more  affordable price than those top of the line cuts.<br /> <br />Grass Fed &amp;amp; Pasture  Raised<br /> Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished, raised free range  on massive, pristine pastures in New Zealand. No hormone or antibiotic growth promotants are ever used,  and GMOs are illegal there.<br /> <br />Because of New Zealand&#x27;s moderate climate,  these cattle are pasture raised year round, with free access to windbreaks and other structures for  shelter from inclement weather.<br /> <br />Selected for Excellence<br /> Silver Fern  Farms is a coop of small family farmers across New Zealand. The Angus program combines the Angus breed,  renowned for superior marbling, flavor, and texture, with a grading system that ensures you get great  beef every time. It has a clean, boldl(more...) ",
    "link": "https://www.marxfoods.com/Grass-fed-Beef-Top-Butt",
    "image_link": "https://www.marxfoods.com/images/Grass-fed-Beef-Top-Butt_Grass-FedBeefTopSirloin-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23572",
    "shipping_weight": "1 lb"
  },
  {
    "id": "12327",
    "title": "Grass-fed Beef Briskets",
    "description": "Briskets offer great flavor when slow cooked until tender (they’re typically smoked or  braised). They’re very popular as a barbecue cut. These briskets are point end cuts, which are smaller  and fattier than brisket flats with a triangular shape.<br /> <br />Grass Fed &amp;amp;  Pasture Raised<br /> Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished, raised  free range on massive, pristine pastures in New Zealand. No hormone or antibiotic growth promotants are  ever used, and GMOs are illegal there.<br /> <br />Because of New Zealand&#x27;s moderate  climate, these cattle are pasture raised year round, with free access to windbreaks and other structures  for shelter from inclement weather.<br /> <br />Selected for Excellence<br /> Silver  Fern Farms is a coop of small family farmers across New Zealand. The Angus program combines the Angus  breed, renowned for superior marbling, flavor, and texture, with a grading system that ensures you get  great beef every time. It has a clean, boldly beefy flavor without the heavy tallow characteristic of  commodity beef. <br /> <br />Careful quality grading ensures it is consistently more  marbled, tender, and flavorful than much of the grass-fed beef available in the US.<br /> <br />Healthier<br  /> Not only is grass fed beef more humane,(more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Beef-Briskets",
    "image_link": "https://www.marxfoods.com/images/Grass-Fed-Beef-Briskets_Grass-FedBeefBriskets-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "24952",
    "title": "Grass-fed Beef Eye of Round",
    "description": "Located in the bottom of the round (rear leg) primal, the eye of round cut may resemble a  tenderloin, but is better suited to slow roasting or moist heat cooking (stews and braises). <br />  <br />Silver Fern brand grass fed beef is raised on the pristine pastures of New Zealand.  With  this beef, “grass fed” means 100% grass fed &amp;amp; grass finished.  Silver Fern beef has been  produced according to strict EU mandated animal welfare conditions.  The cattle are pastured 100% of the  time, with access to paddock areas with windbreaks and other structures for shelter from inclement  weather.<br /><br />This beef is more marbled and flavorful than much of the grass fed beef  available in the US.  Read Why Angus Beef is So Well Regarded and The Different Ways Cattle are Raised  for more information about what makes it so special.<br /><br />Not only is free range grass  fed beef more humane, it’s better for you too.  100% grass fed beef is lower in saturated fat as well as  higher in valuable nutrients like vitamins A &amp;amp; E, conjugated linoleic acid (aka CLA), and  omega-3 fatty acids.<br /> <br /><br /> <br /> ",
    "link": "https://www.marxfoods.com/Grass-fed-Beef-Eye-of-Round",
    "image_link": "https://www.marxfoods.com/images/Grass-fed-Beef-Eye-of-Round_Grass-FedBeefEyeOfRound-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "12364",
    "title": "Grass-Fed Beef Boneless Short Ribs",
    "description": "Short ribs are a more affordable cut that offers superb flavor when slow-braised until  tender. Boneless short ribs can be more convenient and easier to eat than bone-in short ribs.<br />  <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern Farms Angus beef is 100%  grass-fed &amp;amp; finished, raised free range on massive, pristine pastures in New Zealand. No hormone  or antibiotic growth promotants are ever used, and GMOs are illegal there.<br /> <br />Because  of New Zealand&#x27;s moderate climate, these cattle are pasture raised year round, with free access to  windbreaks and other structures for shelter from inclement weather.<br /> <br />Selected for  Excellence<br /> Silver Fern Farms is a coop of small family farmers across New Zealand. The Angus  program combines the Angus breed, renowned for superior marbling, flavor, and texture, with a grading  system that ensures you get great beef every time. It has a clean, boldly beefy flavor without the heavy  tallow characteristic of commodity beef. <br /> <br />Careful quality grading ensures it is  consistently more marbled, tender, and flavorful than much of the grass-fed beef available in the US.<br  /> <br />Healthier<br /> Not only is grass fed beef more humane, it&#x27;s better for you  too. 100% grass fed beef is lower in saturated (more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Boneless-Short-Ribs",
    "image_link": "\r\n                https://www.marxfoods.com/images/Grass-Fed-Boneless-Short-Ribs_Grass-FedBeefBonelessShortRibs.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "9126",
    "title": "Grass-fed Beef Bone In Short Ribs",
    "description": "Short ribs are a classic braising cut.  High in collagen, they need to be cooked low and slow  in order to make them tender, but the results are more than worth the wait.  When braised, all the  collagen melts into the braising liquid, giving it a silky mouth feel and tremendous body.<br />  <br />These grass fed beef short ribs are bone-in. Some people prefer the bone-in version of this  cut because the bones offer additional flavor, help stabilize the meat during cooking so it doesn’t fall  apart, and offer a more interesting look on the plate.  If desired the bones can be easily pulled from  the short ribs after braising so you can serve them boneless.<br /> <br />Grass Fed &amp;amp;  Pasture Raised<br /> Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished, raised  free range on massive, pristine pastures in New Zealand. No hormone or antibiotic growth promotants are  ever used, and GMOs are illegal there.<br /> <br />Because of New Zealand&#x27;s moderate  climate, these cattle are pasture raised year round, with free access to windbreaks and other structures  for shelter from inclement weather.<br /> <br />Selected for Excellence<br /> Silver  Fern Farms is a coop of small family farmers across New Zealand. The Angus program combines the Angus  breed, renowned for superior(more...) ",
    "link": "https://www.marxfoods.com/Grass-fed-Beef-Bone-In-Short-Ribs",
    "image_link": "\r\n                https://www.marxfoods.com/images/Grass-fed-Beef-Bone-In-Short-Ribs_Grass-FedBeefBoneInShortRibs-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25209",
    "title": "Grass-fed Beef Whole Bone-in Ribeyes",
    "description": "Bone-in whole ribeyes (aka export ribs) are the full (lip-on) muscle that ribeye steaks are  cut from.  The included rib bones give the cut structure, a striking presentation, and are believed to  provide additional flavor.  These ribeyes have been processed so that they can be roasted whole as a  standing rib roast or easily sliced into individual ribeye steaks.<br /><br /> Ribeye steaks  and roasts have an excellent, boldly beefy flavor that makes them in high demand at top steak houses.   No fancy sauces are necessary – some salt and a few grinds of pepper are all a ribeye needs to shine.<br  /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern Farms Angus beef is 100%  grass-fed &amp;amp; finished, raised free range on massive, pristine pastures in New Zealand. No hormone  or antibiotic growth promotants are ever used, and GMOs are illegal there.<br /> <br />Because  of New Zealand&#x27;s moderate climate, these cattle are pasture raised year round, with free access to  windbreaks and other structures for shelter from inclement weather.<br /> <br />Selected for  Excellence<br /> Silver Fern Farms is a coop of small family farmers across New Zealand. The Angus  program combines the Angus breed, renowned for superior marbling, flavor, and texture, with a grading  system that ensur(more...) ",
    "link": "https://www.marxfoods.com/grass-fed-bone-in-ribeye",
    "image_link": "\r\n                https://www.marxfoods.com/images/grass-fed-bone-in-ribeye_Grass-FedBeefWholeBone-InRibeyes-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23572",
    "shipping_weight": "1 lb"
  },
  {
    "id": "9695",
    "title": "Grass-fed Beef Hanger Steaks",
    "description": "Hanger steaks (aka hanging tenders, butcher’s steaks, &quot;thick skirts&quot;, onglets) are  cut from the plate, between the brisket &amp;amp; the flank. With a slightly chewy, stringy texture  similar to skirt steaks, hanger steaks offer particularly full beefy, liver-y, almost game-meat-esque  flavor.  Like skirt steaks, they work particularly well with marinades.<br /> <br />Until  recently hanger steaks were relatively unknown in the US - many American butchers kept them for  themselves.  They’ve long been popular in Europe and are considered a classic French bistro cut.  Today  they’re showing up on more and more restaurant menus as American chefs discover their beefy flavor and  affordable price. <br /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern  Farms Angus beef is 100% grass-fed &amp;amp; finished, raised free range on massive, pristine pastures  in New Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal there.<br  /> <br />Because of New Zealand&#x27;s moderate climate, these cattle are pasture raised year  round, with free access to windbreaks and other structures for shelter from inclement weather.<br />  <br />Selected for Excellence<br /> Silver Fern Farms is a coop of small family farmers  across New Zealand. The Angus program combines(more...) ",
    "link": "https://www.marxfoods.com/Grass-fed-Beef-Hanger-Steaks",
    "image_link": "\r\n                https://www.marxfoods.com/images/Grass-fed-Beef-Hanger-Steaks_Grass-FedBeefHangerSteaks-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23572",
    "shipping_weight": "1 lb"
  },
  {
    "id": "12366",
    "title": "Grass-Fed Beef Outer Skirt Steaks",
    "description": "Skirt steaks are a long, thin cut from the plate primal. They offer bold, beefy flavor at a  more affordable price than highly prized ribeyes, tenderloins, etc. Inner skirt steaks are the  quintessential fajita cut, while outer skirt steaks are usually served sliced as a center-of-plate steak  rather than as an ingredient.<br /> <br />Grass Fed &amp;amp; Pasture Raised<br />  Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished, raised free range on massive,  pristine pastures in New Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are  illegal there.<br /> <br />Because of New Zealand&#x27;s moderate climate, these cattle are  pasture raised year round, with free access to windbreaks and other structures for shelter from  inclement weather.<br /> <br />Selected for Excellence<br /> Silver Fern Farms is a  coop of small family farmers across New Zealand. The Angus program combines the Angus breed, renowned  for superior marbling, flavor, and texture, with a grading system that ensures you get great beef every  time. It has a clean, boldly beefy flavor without the heavy tallow characteristic of commodity beef.  <br /> <br />Careful quality grading ensures it is consistently more marbled, tender, and  flavorful than much of the grass-fed beef available in the(more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Outer-Skirt-Steaks",
    "image_link": "\r\n                https://www.marxfoods.com/images/Grass-Fed-Outer-Skirt-Steaks_Grass-FedBeefOuterSkirtSteaks-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "9127",
    "title": "Grass-fed Beef Inner Skirt Steaks",
    "description": "Inner skirt steaks are the quintessential fajita cut.  These steaks are long and thin, more  similar to flank steaks than strip steaks. They offer excellent, rich flavor, but have a stringier,  chewier texture.  They absorb marinades well, are excellent grilled, and should be thinly sliced against  the grain.<br /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern Farms  Angus beef is 100% grass-fed &amp;amp; finished, raised free range on massive, pristine pastures in New  Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal there.<br />  <br />Because of New Zealand&#x27;s moderate climate, these cattle are pasture raised year round,  with free access to windbreaks and other structures for shelter from inclement weather.<br /> <br  />Selected for Excellence<br /> Silver Fern Farms is a coop of small family farmers across New  Zealand. The Angus program combines the Angus breed, renowned for superior marbling, flavor, and  texture, with a grading system that ensures you get great beef every time. It has a clean, boldly beefy  flavor without the heavy tallow characteristic of commodity beef. <br /> <br />Careful  quality grading ensures it is consistently more marbled, tender, and flavorful than much of the  grass-fed beef available in the US.(more...) ",
    "link": "https://www.marxfoods.com/Grass-fed-Beef-Skirt-Steaks",
    "image_link": "\r\n                https://www.marxfoods.com/images/Grass-fed-Beef-Skirt-Steaks_Grass-fedBeefInnerSkirtSteaks-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "23475",
    "title": "Grass-Fed Beef Cheeks",
    "description": "Beef cheeks are an affordable, intensely flavorful cut from the head. They have a prominent  grain, lots of connective tissue, and are very tough – but when braised all that tissue melts into  gelatin and the cheek becomes luxuriously tender. This culinary alchemy makes the cheek a chef-favorite  cut, especially for autumn &amp;amp; winter menus.<br /> <br />Grass Fed &amp;amp; Pasture  Raised<br /> Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished, raised free range  on massive, pristine pastures in New Zealand. No hormone or antibiotic growth promotants are ever used,  and GMOs are illegal there.<br /> <br />Because of New Zealand&#x27;s moderate climate,  these cattle are pasture raised year round, with free access to windbreaks and other structures for  shelter from inclement weather.<br /> <br />Selected for Excellence<br /> Silver Fern  Farms is a coop of small family farmers across New Zealand. The Angus program combines the Angus breed,  renowned for superior marbling, flavor, and texture, with a grading system that ensures you get great  beef every time. It has a clean, boldly beefy flavor without the heavy tallow characteristic of  commodity beef. <br /> <br />Careful quality grading ensures it is consistently more  marbled, tender, and flavorful than much of the grass-fed(more...) ",
    "link": "https://www.marxfoods.com/Grass-Fed-Beef-Cheeks",
    "image_link": "https://www.marxfoods.com/images/Grass-Fed-Beef-Cheeks_GrassFedBeefCheeks-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "13186",
    "title": "Grass-fed Beef Oxtails",
    "description": "Oxtails are a high-gelatin, flavorful, and affordable bone-in cut that are wonderful stewed  or slow-braised until the meat is fork tender.  During cooking their gelatin melts into the broth,  giving it rich body and a delightful mouth feel.<br /> <br />While oxtails are often sold  pre-sliced into disks (that look like small osso bucco), these are actually whole oxtails that have had  the tips trimmed off and some of the fat on the body-end removed.<br /> <br />Grass Fed  &amp;amp; Pasture Raised<br /> Silver Fern Farms Angus beef is 100% grass-fed &amp;amp; finished,  raised free range on massive, pristine pastures in New Zealand. No hormone or antibiotic growth  promotants are ever used, and GMOs are illegal there.<br /> <br />Because of New Zealand&#x27;s  moderate climate, these cattle are pasture raised year round, with free access to windbreaks and other  structures for shelter from inclement weather.<br /> <br />Selected for Excellence<br />  Silver Fern Farms is a coop of small family farmers across New Zealand. The Angus program combines the  Angus breed, renowned for superior marbling, flavor, and texture, with a grading system that ensures you  get great beef every time. It has a clean, boldly beefy flavor without the heavy tallow characteristic  of commodity beef. <br /> <br />Care(more...) ",
    "link": "https://www.marxfoods.com/Grassfed-Whole-Oxtails",
    "image_link": "https://www.marxfoods.com/images/Grassfed-Whole-Oxtails_Grass-FedBeefOxtails-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23570",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25233",
    "title": "Ground Grass-fed Angus Beef",
    "description": "Ground beef (aka mince beef) is extremely versatile and can be turned into burgers,  meatballs, meat loaf, meat sauce for pasta, chili, and more.&amp;nbsp; This ground beef has an 85%/15%  lean/fat ratio and is ground from only solid muscle, so it has a superior texture to beef ground from  cheaper trim.<br /> <br />Grass Fed &amp;amp; Pasture Raised<br /> Silver Fern Farms  Angus beef is 100% grass-fed &amp;amp; finished, raised free range on massive, pristine pastures in New  Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal there.<br />  <br />Because of New Zealand&#x27;s moderate climate, these cattle are pasture raised year round,  with free access to windbreaks and other structures for shelter from inclement weather.<br /> <br  />Selected for Excellence<br /> Silver Fern Farms is a coop of small family farmers across New  Zealand. The Angus program combines the Angus breed, renowned for superior marbling, flavor, and  texture, with a grading system that ensures you get great beef every time. It has a clean, boldly beefy  flavor without the heavy tallow characteristic of commodity beef. <br /> <br />Careful  quality grading ensures it is consistently more marbled, tender, and flavorful than much of the  grass-fed beef available in the US.<br /> <br />Health(more...) ",
    "link": "https://www.marxfoods.com/Grass-fed-Ground-Beef",
    "image_link": "https://www.marxfoods.com/images/Grass-fed-Ground-Beef_Grass-FedBeefGroundMeat.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23572",
    "shipping_weight": "1 lb"
  },
  {
    "id": "13932",
    "title": "Reserve Grass-Fed Flat Irons",
    "description": "Cut from the shoulder (chuck), the flat iron is a unique portion that is more tender than the  surrounding muscle.  While flat iron meat is delicious – flavorful and quite tender - the muscle has a  thick layer of silver skin running through it that must be removed before it can be enjoyed.  <br />  <br />Because they require more butchery than the prime steak cuts, flat irons offer great flavor  &amp;amp; texture at a more affordable price.  For a video guide demonstrating how to clean a flat iron,  click the “Recipes &amp;amp; Tips” tab. <br /> <br />The Top 4% - Graded for Unparalleled  Quality<br /> Silver Fern Farms’ 100% Grass-Fed Reserve Beef is amongst the finest beef New  Zealand produces, representing around the top 4% of production.  That makes it some of the very best  grass-fed beef in the world. <br /> <br />Exceptionally tender and flavorful, this beef is  hand selected according to the “Eating Quality” (EQ) grading system.  The EQ System is a set of  standards developed through a university study involving 13,900 taste testers across 17 cities tasting  97,000 samples in order to quantifiably determine what makes the best beef. <br /> <br />Farmers  whose beef grades into the Reserve program are paid a premium and are given feedback allowing them to  further i(more...) ",
    "link": "https://www.marxfoods.com/Reserve-Flat-Irons",
    "image_link": "https://www.marxfoods.com/images/Reserve-Flat-Irons_ReserveGrass-FedFlatIrons-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23573",
    "shipping_weight": "1 lb"
  },
  {
    "id": "13933",
    "title": "Reserve Grass-Fed Striploins",
    "description": "The striploin is the muscle typically cut into NY strip steaks and offers a good balance of  flavor and tenderness.  Striploins can also be cooked whole as luxurious roasts. <br /> <br />These  striploins have had most of their tail meat and outer fat layer trimmed off for your convenience (1x1).   Because the butchery work has been done for you, it&amp;rsquo;s simple to slice them into steaks without  much trimming. <br /> <br />The Top 4% - Graded for Unparalleled Quality<br /> Silver  Fern Farms&amp;rsquo; 100% Grass-Fed Reserve Beef is amongst the finest beef New Zealand produces,  representing around the top 4% of production.  That makes it some of the very best grass-fed beef in the  world. <br /> <br />Exceptionally tender and flavorful, this beef is hand selected according  to the &amp;ldquo;Eating Quality&amp;rdquo; (EQ) grading system.  The EQ System is a set of standards  developed through a university study involving 13,900 taste testers across 17 cities tasting 97,000  samples in order to quantifiably determine what makes the best beef. <br /> <br />Farmers  whose beef grades into the Reserve program are paid a premium and are given feedback allowing them to  further improve the quality of their herd. <br /> <br />Grass-Fed &amp;amp; Pasture Raised<br  /> Reserve cattle are grass-fed (more...) ",
    "link": "https://www.marxfoods.com/Reserve-Teres-Majors_2",
    "image_link": "https://www.marxfoods.com/images/Reserve-Teres-Majors_2_ReserveGrass-FedStriploins-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23573",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3745",
    "title": "Bison Skirt Steaks",
    "description": "Bison skirt steaks have a stringy, chewy texture that makes them less popular than the  premium steak cuts. However, this simply makes them more affordable, and they actually offer some of the  richest flavor of all steaks. Their loose texture makes them particularly well suited to absorbing  marinades. <br /> <br />Skirt steaks are the traditional cut used in making fajitas. Because  of their long muscle fibers, they are best served thinly sliced against the grain.<br /> <br />Bison&#x27;s&amp;nbsp;flavor  is often described as a richer&amp;nbsp;version of beef&amp;nbsp;with just a hint of sweetness. It is  not gamey at all, and has a deeper red color and coarser grain than beef.<br /> <br />Like  many game meats, bison meat is much healthier than conventional grain-fed beef. Its primary health  benefits are its low fat content (less than a third as much fat as similar cuts of beef), lower  cholesterol (less than skinless chicken) and high amount of iron. This makes it an ideal red meat choice  for those concerned about eating heart healthy food.<br /><br /> ",
    "link": "https://www.marxfoods.com/bison-outer-skirt-steak",
    "image_link": "https://www.marxfoods.com/images/bison-outer-skirt-steak_BisonSkirtSteaks-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2519",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3746",
    "title": "Bison Flanks",
    "description": "Similar to bison skirt steaks and hanger steaks, flank steaks are another underappreciated  cut that absorbs marinades well &amp;amp; is excellent grilled.<br /><br />Because flank  steaks aren&#x27;t as tender as premium steaks like ribeyes and filet mignons, they&#x27;re generally  more affordable, but still offer great flavor. <br /> <br />Bison&#x27;s&amp;nbsp;flavor is  often described as a richer&amp;nbsp;version of beef&amp;nbsp;with just a hint of sweetness. It is not  gamey at all, and has a deeper red color and coarser grain than beef.&amp;nbsp; <br /> <br />Like  many game meats, bison meat is much healthier than conventional grain-fed beef. Its primary health  benefits are its low fat content (less than a third as much fat as similar cuts of beef), lower  cholesterol (less than skinless chicken) and high amount of iron. This makes it an ideal red meat choice  for those concerned about eating heart healthy food.<br /><br /> ",
    "link": "https://www.marxfoods.com/bison-flank-steaks",
    "image_link": "https://www.marxfoods.com/images/bison-flank-steaks_BisonFlankSteaks-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2519",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26004",
    "title": "Bison Striploins",
    "description": "Bison striploins (aka buffalo striploins) can be roasted whole or sliced into strip steaks of  whatever thickness you choose.  Strip steaks are a cut prized by steak fans for their balance of good  flavor and tenderness. <br /> <br />Bison&#x27;s flavor is often described as a  richer version of beef with just a hint of sweetness. It is not gamey at all, and has a deeper red color  and coarser grain than beef.<br /><br />Like many game meats, bison meat is much healthier  than conventional grain-fed beef. Its primary health benefits are its low fat content (less than a third  as much fat as similar cuts of beef), lower cholesterol (less than skinless chicken) and high amount of  iron. This makes it an ideal red meat choice for those concerned about eating heart healthy food. <br  /> <br />Pre-sliced buffalo NY strip steaks are also available.<br /><br /> ",
    "link": "https://www.marxfoods.com/Bison-Striploins",
    "image_link": "https://www.marxfoods.com/images/Bison-Striploins_BisonStriploins-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2519",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26006",
    "title": "Bison Hanger Steaks",
    "description": "Hanger steaks are thick cuts of meat cut from the Plate, between the brisket &amp;amp; the  flank. Until relatively recently the hanger steak was a cut most often found for sale in Europe, while  most American butchers kept it for themselves. With a slightly chewy, stringy texture similar to bison  skirt steaks, bison hanger steaks offer particularly bold flavor and are a great choice for marinating.<br  /> <br />Bison&#x27;s flavor is often described as a richer version of beef with just a hint of  sweetness. It has a deeper red color and coarser grain than beef.<br /> <br />Like many game  meats, bison meat is much healthier than conventional grain-fed beef. It’s primary health benefits are  its low fat content (less than a third as much fat as similar cuts of beef), lower cholesterol (less  than skinless chicken) and high amount of iron. This makes it an ideal red meat choice for those  concerned about eating heart healthy food.<br /><br /> ",
    "link": "https://www.marxfoods.com/bison-hanger-steaks",
    "image_link": "https://www.marxfoods.com/images/bison-hanger-steaks_BisonHangerSteaks-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2519",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26009",
    "title": "Bison Burgers",
    "description": "Bison burgers offer a healthier, more robust twist on the burger, with a bold flavor &amp;amp;  less fat. <br /><br />Bison&#x27;s flavor is often described as a richer version of  beef with just a hint of sweetness. It is not gamey at all, and has a deeper red color and coarser grain  than beef.  <br /> <br />Like many game meats, bison meat is much healthier than  conventional grain-fed beef. Its primary health benefits are its low fat content (less than a third as  much fat as similar cuts of beef), lower cholesterol (less than skinless chicken) and high amount of  iron. This makes it an ideal red meat choice for those concerned about eating heart healthy food.<br  /><br /> ",
    "link": "https://www.marxfoods.com/bison-burgers",
    "image_link": "https://www.marxfoods.com/images/bison-burgers_BisonBurgers-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2519",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26008",
    "title": "Ground Bison",
    "description": "Ground bison is extremely versatile and can be used as a healthier alternative to ground beef  in most (if not all) recipes. <br /><br />Bison&#x27;s flavor is often described as a  richer version of beef with just a hint of sweetness. It is not gamey at all, and has a deeper red color  and coarser grain than beef.<br /> <br />Like many game meats, bison meat is healthier than  conventional grain-fed beef. Its primary health benefits are its low fat content (less than a third as  much fat as similar cuts of beef), lower cholesterol (less than skinless chicken) and high amount of  iron. This makes it an ideal red meat choice for those concerned about eating heart healthy food.<br  /><br /> ",
    "link": "https://www.marxfoods.com/bison_ground",
    "image_link": "https://www.marxfoods.com/images/bison_ground_GroundBison-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2519",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26007",
    "title": "Bison Short Ribs",
    "description": "Short ribs are one of bison&#x27;s most flavorful and under rated cuts. They are delicious  when slow braised in a flavorful sauce.<br /> <br />Bison&#x27;s flavor is often described  as a richer version of beef with just a hint of sweetness. It is not gamey at all, and has a deeper red  color and coarser grain than beef.<br /> <br />Like many game meats, bison meat is much  healthier than conventional grain-fed beef. Its primary health benefits are its low fat content (less  than a third as much fat as similar cuts of beef), lower cholesterol (less than skinless chicken) and  high amount of iron. This makes it an ideal red meat choice for those concerned about eating heart  healthy food.<br /><br /> ",
    "link": "https://www.marxfoods.com/Bison-Short-Ribs",
    "image_link": "https://www.marxfoods.com/images/Bison-Short-Ribs_BisonShortRibs-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2519",
    "shipping_weight": "1 lb"
  },
  {
    "id": "8504",
    "title": "Canadian Elk Striploin",
    "description": "Elk striploins are cut from the saddle (back) and are one of the more tender elk meat cuts  available.  They are suitable for roasting whole or slicing into individual steaks, noisettes (small  steaks), or medallions.<br /><br />These striploins have had their surface layer of  silverskin removed for your convenience.<br /><br />Elk is considered by some people to  offer the best flavor of all the venison game meats (deer meat, elk meat, antelope meat, moose, etc).  When compared to deer meat and antelope meat, its flavor is on the beefier side, making it a great  choice for stews and burgers. Because it’s very low in fat and cholesterol and high in zinc and iron,  elk is a healthy alternative to beef.<br /><br /> ",
    "link": "https://www.marxfoods.com/Buy-Elk-Striploins",
    "image_link": "https://www.marxfoods.com/images/Buy-Elk-Striploins_CanadianElkStriploin-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2438",
    "shipping_weight": "1 lb"
  },
  {
    "id": "24882",
    "title": "Elk Stew Meat",
    "description": "Stew meat cubes are cut from muscles that are too tough for quick cooking techniques like  grilling and sautéing. However, this meat often offers excellent flavor, and when stewed or braised  becomes incredibly tender and delicious.<br /><br />Elk is considered by some people to  offer the best flavor of all the venison game meats (deer meat, elk meat, antelope meat, moose, etc).  When compared to deer meat and antelope meat, its flavor is on the beefier side, making it a great  choice for stews and burgers. Because it’s very low in fat and cholesterol and high in zinc and iron,  elk&amp;nbsp;is a&amp;nbsp;healthy alternative to beef.<br /><br /> ",
    "link": "https://www.marxfoods.com/Elk-Stew-Meat",
    "image_link": "https://www.marxfoods.com/images/Elk-Stew-Meat_ElkStewMeat-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2438",
    "shipping_weight": "1 lb"
  },
  {
    "id": "23588",
    "title": "Grass-Fed Lamb Burgers",
    "description": "Looking for a break from beef burgers? Lamb is an excellent choice! Its robust flavor opens  the door to a wide variety of exciting new seasonings, sauces, and toppings. <br /> <br />These  Crown Range brand burgers are made from premium ground Ovation lamb and vacuum packed 2-per pack. All  you have to do is thaw, season, and sear or grill!<br /><br />Not only do these patties make  great burgers, but they can also be easily broken up &amp;amp; used as ground lamb.<br /><br />Ovation  lamb is 100% grass-fed &amp;amp; pasture raised free range in New Zealand. No hormone or antibiotic  growth promotants are ever used, and GMOs are illegal in New Zealand. All cuts in this program are aged  for 96 hours before blast freezing – longer than other lamb programs – in order to bring the lamb to the  pinnacle of tenderness &amp;amp; flavor.<br /><br />Grass-fed lamb is lower in saturated fat  and higher in healthy vitamins, omega-3 fatty acids, and conjugated linoleic acid (CLA) than grain-fed  lamb.<br /><br /> ",
    "link": "https://www.marxfoods.com/grassfed-lamb-burgers",
    "image_link": "https://www.marxfoods.com/images/grassfed-lamb-burgers_grassfedlambburgers-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "78",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22722",
    "title": "Iberico Pork Back Fat",
    "description": "Back fat (aka Iberico fat back) is creamy, sweet fat from the belly of the hog.&amp;nbsp; It  can be used in a variety of applications: sausage making, making rillettes, barding (wrapping lean meat  or poultry in fat to keep it moist during cooking), or curing to produce lardo, an Italian delicacy.  <br /> <br />Iberico back fat offers a significant flavor upgrade over conventional pork  back fat. <br /> <br />Iberico pork is a Spanish culinary treasure, amongst the finest pork  in the world.&amp;nbsp; While iberico is best known for the famous slow-aged hams, the other cuts are  succulent, moist &amp;amp; delicious.&amp;nbsp; This iberico pork is raised free range on traditional  Spanish pastures known as dehesas.&amp;nbsp; It’s fed a natural diet of grain, corn, wheat, grass &amp;amp;  forage.&amp;nbsp; No added growth hormones or sub-therapeutic antibiotics are ever used. <br />  <br />Iberico pork raised in this way is considered “Campo Iberian Pork” under Spanish law, a term  which requires that the animals are raised in the open air on an all-natural cereal-based diet. <br />  <br />* Minimally Processed, No Chemical Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Iberico-Back-Fat",
    "image_link": "https://www.marxfoods.com/images/Iberico-Back-Fat_IbericoBackFat-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22652",
    "title": "Iberico Pork Bellies",
    "description": "Iberico pork bellies (aka Panceta) are a rich, succulent cut with flavorful ribbons of fat  &amp;amp; meat. This is the same cut bacon is made from, but it is also delicious slow-roasted or  braised until tender.  These bellies are sold with the skin on. <br /> <br />Iberico pork is  a Spanish culinary treasure, amongst the finest pork in the world.  While iberico is best known for the  famous slow-aged hams, the other cuts are succulent, moist &amp;amp; delicious.  This iberico pork is  raised free range on traditional Spanish pastures known as dehesas.  It’s fed a natural diet of grain,  corn, wheat, grass &amp;amp; forage.  No added growth hormones or sub-therapeutic antibiotics are ever  used. <br /> <br />Iberico pork raised in this way is considered “Campo Iberian Pork” under  Spanish law, a term which requires that the animals are raised in the open air on an all-natural  cereal-based diet. <br /> <br />* Minimally Processed, No Chemical Ingredients<br /><br  /> ",
    "link": "https://www.marxfoods.com/Iberico-Pork-Bellies",
    "image_link": "https://www.marxfoods.com/images/Iberico-Pork-Bellies_IbericoPorkBellies-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22646",
    "title": "Iberico Pork Tenderloins",
    "description": "Iberico pork tenderloins (aka Solomillo) are tender, easy to cook smaller cuts that are  delicious cooked quickly &amp;amp; sliced into medallions.  They can be served with a flavorful sauce or  simply seasoned with salt &amp;amp; pepper. <br /> <br />Iberico pork is a Spanish culinary  treasure, amongst the finest pork in the world.  While iberico is best known for the famous slow-aged  hams, the other cuts are succulent, moist &amp;amp; delicious.  This iberico pork is raised free range  on traditional Spanish pastures known as dehesas.  It’s fed a natural diet of grain, corn, wheat, grass  &amp;amp; forage.  No added growth hormones or sub-therapeutic antibiotics are ever used. <br />  <br />Iberico pork raised in this way is considered “Campo Iberian Pork” under Spanish law, a term  which requires that the animals are raised in the open air on an all-natural cereal-based diet. <br />  <br />* Minimally Processed, No Chemical Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Iberico-Pork-Tenderloins",
    "image_link": "https://www.marxfoods.com/images/Iberico-Pork-Tenderloins_IbericoPorkTenderloins-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22651",
    "title": "Iberico Pork Secretos",
    "description": "The secreto is a small, hidden (“secret”) boneless cut from behind the shoulder. Tender,  well-marbled &amp;amp; delicious, this is a great cut for quick cooking applications like searing or  grilling.  It offers great flavor even when simply served seasoned with salt &amp;amp; pepper. <br />  <br />Even though it&#x27;s cut from an entirely different part of the animal, secreto is  sometimes referred to as “skirt steak” in the US, because it’s cooked similarly. <br /> <br />Iberico  pork is a Spanish culinary treasure, amongst the finest pork in the world.  While iberico is best known  for the famous slow-aged hams, the other cuts are succulent, moist &amp;amp; delicious.  This iberico  pork is raised free range on traditional Spanish pastures known as dehesas.  It’s fed a natural diet of  grain, corn, wheat, grass &amp;amp; forage.  No added growth hormones or sub-therapeutic antibiotics are  ever used. <br /> <br />Iberico pork raised in this way is considered “Campo Iberian Pork”  under Spanish law, a term which requires that the animals are raised in the open air on an all-natural  cereal-based diet. <br /> <br />* Minimally Processed, No Chemical Ingredients<br /><br  /> ",
    "link": "https://www.marxfoods.com/Iberico-Pork-Secreto",
    "image_link": "https://www.marxfoods.com/images/Iberico-Pork-Secreto_IbericoPorkSecretos.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22647",
    "title": "Iberico Pork Striploins",
    "description": "Iberico pork striploins (aka Lomo) are a lean, tender, mild-flavored boneless cut.  Though  they are narrower than conventional pork loin, they can be cooked similarly – roasted as whole portions  or sliced into pork chops.  These striploins have been cleaned before vacuum packing. <br /> <br  />Iberico pork is a Spanish culinary treasure, amongst the finest pork in the world.  While iberico  is best known for the famous slow-aged hams, the other cuts are succulent, moist &amp;amp; delicious.   This iberico pork is raised free range on traditional Spanish pastures known as dehesas.  It’s fed a  natural diet of grain, corn, wheat, grass &amp;amp; forage.  No added growth hormones or sub-therapeutic  antibiotics are ever used. <br /> <br />Iberico pork raised in this way is considered “Campo  Iberian Pork” under Spanish law, a term which requires that the animals are raised in the open air on an  all-natural cereal-based diet. <br /> <br />* Minimally Processed, No Chemical Ingredients<br  /><br /> ",
    "link": "https://www.marxfoods.com/Iberico-Pork-Striploins",
    "image_link": "https://www.marxfoods.com/images/Iberico-Pork-Striploins_IbericoPorkStriploins-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22644",
    "title": "Iberico Pork Frenched Racks",
    "description": "Iberico pork frenched racks (aka chuletero) are an impressive cut that can either be roasted  whole or sliced into bone-in pork chops.  These 11-rib racks have had their bones frenched (cleaned of  surface membranes and connecting meat) for a more elegant presentation.  They have also been cut in half  in order to fit them into their vacuum bags, with each individually wrapped piece constituting ½ of a  rack. <br /> <br />Iberico pork is a Spanish culinary treasure, amongst the finest pork in  the world.  While iberico is best known for the famous slow-aged hams, the other cuts are succulent,  moist &amp;amp; delicious.  This iberico pork is raised free range on traditional Spanish pastures known  as dehesas.  It’s fed a natural diet of grain, corn, wheat, grass &amp;amp; forage.  No added growth  hormones or sub-therapeutic antibiotics are ever used. <br /> <br />Iberico pork raised in  this way is considered “Campo Iberian Pork” under Spanish law, a term which requires that the animals  are raised in the open air on an all-natural cereal-based diet. <br /> <br />* Minimally  Processed, No Chemical Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Iberico-Frenched-Racks",
    "image_link": "https://www.marxfoods.com/images/Iberico-Frenched-Racks_IbericoPorkFrenchedRacks-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22680",
    "title": "Iberico Pork Spare Ribs",
    "description": "Pork ribs are a lower cost, intensely flavorful bone-in cut that must be slow cooked until  tender.&amp;nbsp; Spare ribs are larger, fattier ribs than the baby backs, with a rich, meaty flavor.&amp;nbsp;  Iberico pork spare ribs are more delicious, but naturally smaller than conventional pork ribs.<br />  <br />These spare ribs are a St Louis cut.&amp;nbsp; This means they have been cut down &amp;amp;  squared off from the whole spare rib rack, making them easier to cook &amp;amp; eat.<br /> <br  />Iberico pork is a Spanish culinary treasure, amongst the finest pork in the world.&amp;nbsp; While  iberico is best known for the famous slow-aged hams, the other cuts are succulent, moist &amp;amp;  delicious.&amp;nbsp; This iberico pork is raised free range on traditional Spanish pastures known as  dehesas.&amp;nbsp; It’s fed a natural diet of grain, corn, wheat, grass &amp;amp; forage.&amp;nbsp; No  added growth hormones or sub-therapeutic antibiotics are ever used.<br /> <br />Iberico pork  raised in this way is considered “Campo Iberian Pork” under Spanish law, a term which requires that the  animals are raised in the open air on an all-natural cereal-based diet.<br /> <br />*  Minimally Processed, No Chemical Ingredients<br /> <br />Note: Due to the presence of bones,  it is possible that the vacuum packages may leak dur(more...) ",
    "link": "https://www.marxfoods.com/Iberico-Spare-Ribs",
    "image_link": "https://www.marxfoods.com/images/Iberico-Spare-Ribs_IbericoPorkSpareRibs-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "23227",
    "title": "Iberico Pork Collars",
    "description": "The Iberico pork collar (aka Boneless Neck, Cabecero) is a well marbled, exquisitely  flavorful cut that can be roasted, braised, or sliced into steaks for quick searing. <br /> <br  />Iberico pork is a Spanish culinary treasure, amongst the finest pork in the world.  While iberico  is best known for the famous slow-aged hams, the other cuts are succulent, moist &amp;amp; delicious.   This Iberico pork is raised free range on traditional Spanish pastures known as dehesas.  It’s fed a  natural diet of grain, corn, wheat, grass &amp;amp; forage.  No added growth hormones or sub-therapeutic  antibiotics are ever used. <br /> <br />Iberico pork raised in this way is considered “Campo  Iberian Pork” under Spanish law, a term which requires that the animals are raised in the open air on an  all-natural cereal-based diet. <br /> <br />* Minimally Processed, No Chemical Ingredients<br  /><br /> ",
    "link": "https://www.marxfoods.com/Iberico-Pork-Collars",
    "image_link": "https://www.marxfoods.com/images/Iberico-Pork-Collars_Iberico-Pork-Collars-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "23583",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3732",
    "title": "Kurobuta Pork Racks",
    "description": "The intense marbling and tenderness of the Kurobuta pork makes it ideal for such an elegant  cut as the rib rack. Rib racks (aka rack roast of pork) are a classic cut, and these racks are  center-cut – you are only buying the thickest, most meaty part of the rack. Each rack can be separated  into about eight rib chops before or after cooking.<br /> <br />Kurobuta pork (aka Berkshire  pork) is from a rare breed of pig that has long been bred in England and Japan for flavor and more  marbled meat. The result is some of the finest pork in the world, sometimes referred to as &quot;The  Kobe Beef of Pork.&quot; <br /><br /> ",
    "link": "https://www.marxfoods.com/kurobuta-pork-8-bone-rack",
    "image_link": "https://www.marxfoods.com/images/kurobuta-pork-8-bone-rack_KurobutaPorkRacks-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2498",
    "shipping_weight": "1 lb"
  },
  {
    "id": "10487",
    "title": "Kurobuta Hot Dogs",
    "description": "Kurobuta hot dogs are an easy to cook upgrade for your next backyard BBQ, sports party or  quick and tasty meal.&amp;nbsp; Just cook them as you would conventional hot dogs and reap the flavorful  rewards!<br /> <br />These uncured hot dogs are made with 100% pork (no other meats) and are  in natural casings.&amp;nbsp; They offer a firm, juicy bite, bold flavor and an enticing slightly smoky  aroma.<br /> <br />Kurobuta pork (aka Berkshire pork) is from a special breed of pig that  has been bred in England and Japan for flavor and more marbled meat. The result is some of the finest  pork in the world, sometimes referred to as &quot;The Kobe Beef of Pork.&quot;<br /> <br />Ingredients:  Berkshire pork, water, potassium lactate, sea salt, turbinado sugar, natural spices, celery powder,  paprika, onion powder, garlic powder, natural casings.<br /><br />* No artificial  ingredients and only minimally processed.<br /><br /> ",
    "link": "https://www.marxfoods.com/Kurobuta-Hot-Dogs",
    "image_link": "https://www.marxfoods.com/images/Kurobuta-Hot-Dogs_KurobutaHotDogs-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2498",
    "shipping_weight": "1 lb"
  },
  {
    "id": "8491",
    "title": "Kurobuta Slab Bacon",
    "description": "Kurobuta bacon lives up to its luxurious title and heritage. Its flavor has richness and  depth beyond the simple blunt smokiness of conventional bacon.&amp;nbsp;&amp;nbsp;Slab bacon is sold in  large pieces rather than slices.&amp;nbsp; This allows you to cut it to suit your tastes and needs.<br  /> <br />Kurobuta pork (aka Berkshire pork) is from a rare breed of pig that has long been bred  in England and Japan for flavor and more marbled meat. The result is some of the finest pork in the  world, sometimes referred to as &quot;The Kobe Beef of Pork.&quot;<br /> <br />*Minimally  Processed. No Artificial Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Kurobuta-Slab-Bacon",
    "image_link": "https://www.marxfoods.com/images/Kurobuta-Slab-Bacon_KurobutaSlabBacon-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "3225",
    "shipping_weight": "1 lb"
  },
  {
    "id": "7905",
    "title": "Kurobuta Pork St. Louis Spare Ribs",
    "description": "While Kurobuta baby back ribs are cut from along the spine, spareribs are from around the  belly, with meat somewhat similar to pork bellies.&amp;nbsp; Less sought after than baby backs (and  consequently less expensive), spareribs are a higher fat, but also meatier alternative.&amp;nbsp;  Spareribs are quite popular in European, Asian, and American barbecue recipes for their rich flavor.<br  /> <br />These are St. Louis style spare ribs, meaning that the surrounding bones and cartilage  have been removed to make them easier to eat (and so you’re paying for less bone). They&#x27;ve been  trimmed to smaller, more uniform dimensions to make them easier to cook.<br /><br />Kurobuta  pork (aka Berkshire pork) is from a rare breed of pig that has long been bred in England and Japan for  flavor and more marbled meat. The result is some of the finest pork in the world, sometimes referred to  as “The Kobe Beef of Pork.” <br /><br />Note: While this cut is excellent for home use, we  recommend purchasing whole Kurobuta spare rib racks instead for use&amp;nbsp;in competitive BBQ.&amp;nbsp;  St. Louis ribs are cut from younger animals for more tender meat.&amp;nbsp; This also results in smaller  racks that are easy for home cooks to handle, but are less impressive on the competitive circuit. St.  Louis racks are (more...) ",
    "link": "https://www.marxfoods.com/Kurobuta-Pork-Spareribs",
    "image_link": "https://www.marxfoods.com/images/Kurobuta-Pork-Spareribs_KurobutaPorkStLouisSpareRibs-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2498",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4821",
    "title": "Kurobuta Pork Baby Back Ribs",
    "description": "Shorter and meatier than the lower spare ribs, baby back ribs are often the rib lover’s pork  rib of choice.<br /> <br />Most conventional pork has been bred to have as little fat in the  meat as possible. Kurobuta (Berkshire) pigs have instead been encouraged to have as much marbling as  possible, which increases their moistness, tenderness, and flavor when cooked. <br /> <br />Whether  you like your ribs smoked, roasted, or braised, Kurobuta baby back ribs will yield truly delicious  results<br /> ",
    "link": "https://www.marxfoods.com/Kurobuta_Pork_Baby_Back_Ribs",
    "image_link": "https://www.marxfoods.com/images/Kurobuta_Pork_Baby_Back_Ribs_KurobutaPorkBabyBackRibs-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "3225",
    "shipping_weight": "1 lb"
  },
  {
    "id": "10486",
    "title": "Rabbit Hind Leg Quarters",
    "description": "Rabbit meat is tender, lean, and juicy, with a flavor somewhat similar to chicken, but  richer.  Rabbit hind legs are the meatiest part of the animal and have a more robust flavor.  They are  best prepared through slow-cooking techniques like braising, stewing or slow-roasting.<br /> <br  />Each leg quarter includes both the leg and the attached thigh.<br /> <br />Air chilling  (as opposed to the cheaper and more common industrial water chilling) rabbits is a more environmentally  sound process that generates less waste and further improves the flavor and texture of the meat (water  chilled rabbits can absorb water during the chilling process).<br /> <br />These rabbits are  raised by Grupo Hermi, a company that has been raising top quality rabbits in Spain for over 40 years.  They control all aspects of production from breeding for superior genetics to innovative farming,  processing &amp;amp; packaging. European chefs have very high standards when it comes to rabbit, and  Grupo Hermi delivers.<br /><br /> ",
    "link": "https://www.marxfoods.com/Rabbit-Hind-Leg-Quarters",
    "image_link": "https://www.marxfoods.com/images/Rabbit-Hind-Leg-Quarters_RabbitHindLegQuarters-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2442",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4945",
    "title": "Rabbit Bone-In Saddles",
    "description": "Rabbit saddles are the main body of the rabbit, minus the legs and head. Saddle meat is  particularly tender, with a mild and easily adaptable flavor somewhat similar to chicken, but richer.  Like most game meats, it is low in fat, calories and cholesterol.<br /> <br />Bone-in  saddles offer more shape and structure than boneless rabbit saddles, and are commonly roasted whole in  Europe.<br /><br />Air chilling (as opposed to the cheaper and more common industrial water  chilling) rabbits is a more environmentally sound process that generates less waste and further improves  the flavor and texture of the meat (water chilled rabbits can absorb water during the chilling process).<br  /> <br />These rabbits are raised by Grupo Hermi, a company that has been raising top quality  rabbits in Spain for over 40 years. They control all aspects of production from breeding for superior  genetics to innovative farming, processing &amp;amp; packaging. European chefs have very high standards  when it comes to rabbit, and Grupo Hermi delivers.<br /><br /> ",
    "link": "https://www.marxfoods.com/whole-rabbit-meat",
    "image_link": "https://www.marxfoods.com/images/whole-rabbit-meat_RabbitBone-InSaddle-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "68",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22954",
    "title": "Smoked Alligator Sausage",
    "description": "These sausages are made from a Cajun-seasoned blend of alligator meat &amp;amp; pork stuffed  in a natural pork casing.&amp;nbsp; They have been smoked and are fully cooked.<br /> <br />These  sausages are made by a family-run southern Louisiana company that’s been making Cajun sausages for three  generations.<br /> <br />Ingredients: Alligator meat, pork, water, flavorings, salt,  dextrose, parsley.<br /><br /> ",
    "link": "https://www.marxfoods.com/Smoked-Alligator-Sausage",
    "image_link": "https://www.marxfoods.com/images/Smoked-Alligator-Sausage_SmokedAlligatorSausage-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4835",
    "title": "Wild Boar Sweet Italian Sausage",
    "description": "Sweet Italian wild boar sausage is the perfect way to add even more flavor to your rustic  pork dishes. Compared to domestic pork, wild boar is leaner with a stronger flavor that can be used as a  substitute for both pork and venison.<br /> <br />Ingredients: Wild Boar (Meat From Feral  Swine), Pork, Beef, (Beef,Beef Cheek Meat), Water, Salt, Carrot Powder, Butter Flavour  (Maltodextrin,Salt Guar Gum,Sodium Bicarbonate,Gum Arabic,Butter, Contains Milk), Paprika, Spices And  Spice Extracts, Sugar, Dextrose. Stuffed Into A Natural Pork Casing. (May Contain Sulfiting Agents)<br  /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Italian-Sausage",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Italian-Sausage_WildBoarItalianSausage-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3803",
    "title": "Venison Sausage with Merlot",
    "description": "Venison Sausage with Merlot Wine &amp;amp; Blueberries has a subtle blueberry flavor that  compliments the venison. Made with Silver Fern Farms Cervena venison.<br /> <br />Ingredients:  Venison, Pork, Beef, Water, Potatoes, Salt, Carrot Powder (Carrot and 2% Silicone Dioxide), Sugar,  Merlot Wine (Contains Sulfiting Agents), Spices And Spice Extracts (Contains Canola Oil), Dried  Blueberries (Blueberries, High Fructose Corn Syrup And/Or Sugar, Sunflower Oil), Mustard Powder, Ground  Chili Powder, Herbes de Provence (Lavender, Spices, Canola Oil), Onion Powder, Garlic Powder,  Flavorings, Dextrose, Stuffed In A Natural Pork Casing.<br /><br /> ",
    "link": "https://www.marxfoods.com/venison-sausage-merlot-wine-blueberries",
    "image_link": "\r\n                https://www.marxfoods.com/images/venison-sausage-merlot-wine-blueberries_VenisonSausage-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3807",
    "title": "Duck Sausage with Orange Liquor",
    "description": "This sausage features the classic marriage of the savory flavors of duck with sweet &amp;amp;  tangy orange.  Quite versatile, it can be cooked whole or cut from its casings for crumbling into all  manner of dishes.<br /> <br />Ingredients: Duck, Chicken, Pork, Duck Skin, Beef, Potatoes,  Water, Salt, Triple Sec Orange Liquor, Sugar, Spices and Spice Extracts, Carrot Powder (Carrot and 2%  Silicon Dioxide), Lemon Extract, Lemon Oil, Caramel, Butter Flavour (Gum Arabic, Butter (contains Milk),  Modified Corn Starch, Salt, Whey Solids, Nonfat Dry Milk, Dehydrated Butter, Natural Butter Flavor,  Sugar, Xanthan Gum, Lactic Acid, Turmeric and Annatto (for color), Maltodextrin, Sodium Bicarbonate),  Orange Oil, Butterscotch Schnapps (contains Milk), Flavorings, Garlic Powder, Dextrose. Stuffed In A  Natural Pork Casing.<br /><br /> ",
    "link": "https://www.marxfoods.com/duck-sausage-orange-liquor",
    "image_link": "\r\n                https://www.marxfoods.com/images/duck-sausage-orange-liquor_DuckSausageWithOrangeLiquor-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "7065",
    "title": "Pheasant Sausage with Cognac",
    "description": "This game bird sausage blends the mild flavor of pheasant with mace, tarragon, and cognac for  tasty treat that pairs well with most dishes. <br /> <br />Ingredients: Pheasant, Pheasant  Skin, Pork, Chicken, Bacon (cured with Water, Salt, and less than 2% of the following: Brown Sugar,  Sodium Phosphate, Sodium Erythorbate, Sodium Nitrite), Potatoes, Water, Salt, Sugar, Cognac (Contains  Sulfiting Agents), Port Wine (Contains Sulfiting Agents), Spices And Spice Extracts, Onion Powder,  Garlic Powder, Flavoring, Dextrose. Stuffed In A Natural Pork Casing.<br /><br /> ",
    "link": "https://www.marxfoods.com/Pheasant-Sausage-with-Cognac",
    "image_link": "\r\n                https://www.marxfoods.com/images/Pheasant-Sausage-with-Cognac_PheasantSausagewithCognac-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3812",
    "title": "Wild Boar Sausage w/ Cran &amp; Shiraz",
    "description": "This wild boar sausage has a nutty, pork flavor with a note of cranberry that imparts a  slightly sweet taste to the meat. Expertly seasoned and versatile as a whole sausage or crumbled as an  ingredient, each link is large enough for a hearty serving.<br /> <br />Ingredients: Wild  Boar (Meat from Feral Swine), Pork, Beef (Beef, Beef Cheek Meat), Bacon (Cured with Water, Salt and less  than 2% of the following: Brown Sugar, Sodium Phosphate, Sodium Erythorbate, Sodium Nitrite),  Cranberries (Cranberries, Sugar, Sunflower Oil), Salt, Spice and Spices Extracts, Shiraz Wine (Contains  Sulfiting Agents), Sugar, Carrot Powder (Carrot and 2% Silicone Dioxide), Flavorings, Dextrose. Stuffed  in a Natural Pork Casing.<br /><br /> ",
    "link": "https://www.marxfoods.com/wild-boar-sausage-cranberries-shiraz-wine",
    "image_link": "\r\n                https://www.marxfoods.com/images/wild-boar-sausage-cranberries-shiraz-wine_WildBoarSausagewithCranberries-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4511",
    "title": "Lamb Merguez w/ Pork Casing",
    "description": "This Lamb Merguez Sausage has rich lamb flavors with aromatic spices, hints of fennel and  cinnamon combined with cayenne peppers for a little heat. <br /><br />Note: These are  larger, European-style merguez sausages stuffed in a pork casing.  We also offer smaller 100% pork free  traditional merguez sausages stuffed in lamb casings.<br /><br />Ingredients: Lamb, Beef  (Beef Cheek Meat, Beef), Potato, Water, Salt, Sugar, Paprika, Carrot Powder (carrot Powder &amp;amp; 2%  Silicon Dioxide), Butter Flavor (Maltodextrin, Salt, Guar Gum, Sodium Bicarbonate, Gum Arabic, Butter,  Contains Milk), Spices and Spice Extracts, Garlic Powder, Onion Powder, Dextrose. Stuffed In A Natural  Pork Casing. (Contains Sulfiting Agents)<br /><br /> ",
    "link": "https://www.marxfoods.com/lamb-merguez-sausage_2",
    "image_link": "https://www.marxfoods.com/images/lamb-merguez-sausage_2_LambMerguezwPorkCasing-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3806",
    "title": "Rabbit Sausage with White Wine",
    "description": "White wine compliments the rabbit meat in this sausage nicely. Our game meat is USDA  approved.<br /><br /><br />Ingredients: Rabbit, Chicken, Pork, Bacon (Cured with  Water, Salt, and less than 2% of the following: Brown Sugar, Sodium Phosphate, Sodium Erythorbate,  Sodium Nitrite), Potatoes, Water, White Wine (Contains Sulfiting Agents), Salt, Spices and Spice  Extracts, Sugar, Garlic, Onion, Carrot Powder (Carrot &amp;amp; 2% Silicon Dioxide), Flavorings,  Dextrose, Stuffed In A Natural Pork Casing.<br /><br /> ",
    "link": "https://www.marxfoods.com/rabbit-sausage-white-wine",
    "image_link": "https://www.marxfoods.com/images/rabbit-sausage-white-wine_RabbitSausage-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "7529",
    "title": "Wild Boar Sausage w/ Garlic &amp; Wine",
    "description": "These Tuscan-style wild boar sausages combine the complex, nutty flavor of wild boar meat  with rosemary, roasted garlic cloves and Marsala wine.<br /> <br />Ingredients:Wild Boar  (Meat From Feral Swine), Pork, Bacon (cured with: Water, Salt, and less than 2% of the following: Brown  Sugar, Sodium Phoshate, Sodium Erythorbate, Sodium Nitrite), Beef (Beef, Beef Cheeks), Potatoes, Water,  Sherry Wine (Contains Sulfiting Agents), Salt, Spice And Spice Extracts, Roasted Garlic, (Garlic, Soy  Bean Oil, Citric Acid), Sugar, Carrot Powder (Carrot and 2% Silicone Dioxide), Butter Flavour (Gum  Arabic, Butter, Contains Milk, Modified Corn Starch, Salt, Whey Solids, Nonfat Dry Milk, Dehydrated  Butter, Natural Butter Flavor, Sugar, Xanthan Gum, Lactic Acid, Turmeric and Annatto (for color),  Maltodextrin, Sodium Bicarbonate), Marsala Wine (Contains Sulfiting Agents), Mustard Powder, Parsley,  Juniper Berries, Onion Powder, Garlic Powder, Flavorings, Dextrose, Stuffed Into A Natural Pork Casing.<br  /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Sausages-Garlic-Marsala",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Sausages-Garlic-Marsala_WildBoarwGarlic&amp;Marsala-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "7530",
    "title": "Venison Sausage with Demi Glace",
    "description": "The complicated rich/sweet flavor of venison is blended with juniper berries, green  peppercorns, red wine and full-flavored Le Quebecois Veal Demi Glace in these sausages.<br /> <br  />Ingredients: Venison, Beef (Beef, Beef Cheek Meat), Pork, Red Wine (Contains Sulfiting Agents),  Salt, Aged Shoyu Sauce,(Water, Soybeans ,Wheat, Salt), Beef Flavour (Beef Flavour, Beef Extract,  Maltodextrin, Salt, Corn Syrup Solids), Butterscotch Schnapps (Contains Milk), Veal Demi Glace (Veal  Demi Glace, Veal, Water, Carrots, Onions, Celery, Tomato Paste (Tomatoes, Salt, Citric Acid, Leeks, Bay  Leaf), Sugar, Spices And Spice Extracts, Butter Flavour (Contains Butter), Ground Chilli Powder,  Parsley, Onion Powder, Garlic Powder, Ground Juniper Berries, Dextrose, Soy Lecithin, Canola Oil.  Stuffed In Natural Pork Casing.<br /><br /> ",
    "link": "https://www.marxfoods.com/Venison-Sausages-Red-Wine-Demi",
    "image_link": "https://www.marxfoods.com/images/Venison-Sausages-Red-Wine-Demi_VenisonwRedWine&amp;DemiGlace-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "13657",
    "title": "Wild Boar Sausage w/ 3 Chilies",
    "description": "This wild boar sausage is flavored with three types of chilies (including smoky chipotles),  bacon, garlic and other spices.  Our game meat is USDA approved. <br /> <br />Ingredients:   Wild boar (meat from feral swine), pork, beef, beef cheek meat, bacon (cured with: water, salt, and  less than 2% of the following: brown sugar, sodium phosphate, sodium erythorbate, sodium nitrite),  potato, water, chipotle chiles, ancho chilies, chilies, salt, spice and spices extracts (soy lecithin,  tricalcium phosphate and polysorbate 80 added as a manufacturing aid), carrot powder (carrot and 2%  silicone dioxide), sugar, garlic powder, flavorings, dextrose.  Stuffed into a natural pork casing  (contains sulfating agents).<br /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Chilies-Sausage",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Chilies-Sausage_WildBoarChiliesSausage-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2410",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4998",
    "title": "Veal Marrow Bones",
    "description": "Veal marrow bones are used to create rich, thick veal stocks, soup bases, and sauces like  veal demi-glace.  <br /><br /><br />These marrow bones are sold as a blend of  mostly knuckle bones with some pipe bones.  They are not cut for serving roasted as an appetizer.  If  you wish to serve roasted bone marrow, buy canoe-cut beef marrow bones instead.<br /> <br />Le  Québécois is the first veal program to combine USDA approved All Natural* status, humane animal  husbandry, full traceability, and sustainable farming practices.<br /> <br />*Minimally  Processed. No Artificial Ingredients <br /><br /> ",
    "link": "https://www.marxfoods.com/Veal-Marrow-Bones",
    "image_link": "https://www.marxfoods.com/images/Veal-Marrow-Bones_Grain-fedVealMarrowBones-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4778",
    "title": "Le Quebecois Grain-fed Veal Racks",
    "description": "Le Québécois veal racks (aka medium veal hotel rack, chop ready) are delicious roasted whole  or sliced into rib chops for faster searing, grilling, or roasting.<br /> <br />Grain-fed  veal is not the same as ‘pale veal.’ Its natural rose color comes from a varied, nutritious diet,  including grains, which give the meat a more robust flavor for two reasons: First, grains give the meat  subtle marbling that infuses the meat with flavor and tenderness that veal is known for. Second,  grain-fed veal contains more iron and other minerals which add to the delicious flavor and the animal’s  health. <br /> <br />Le Québécois is the first veal program to combine USDA approved All  Natural* status, humane animal husbandry, full traceability, and sustainable farming practices. <br />  <br />*Minimally Processed. No Artificial Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Grain-fed-Veal-Racks",
    "image_link": "https://www.marxfoods.com/images/Grain-fed-Veal-Racks_LeQuebecoisGrain-FedVealRacks-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3978",
    "title": "Grain-fed Veal Frenched Rib Chops",
    "description": "Frenched rib chops always deliver stylish plate presentation and Le Québécois Grain-fed Veal  has a great flavor that stands on its own and doesn’t have to be heavily sauced.<br /> <br />Grain-fed  veal is not the same as ‘pale veal.’ Its natural rose color comes from a varied, nutritious diet,  including grains, which give the meat a more robust flavor for two reasons: First, grains give the meat  subtle marbling that infuses the meat with flavor and tenderness that veal is known for. Second,  grain-fed veal contains more iron and other minerals which add to the delicious flavor and the animal’s  health. <br /> <br />Le Québécois is the first veal program to combine USDA approved All  Natural* status, humane animal husbandry, full traceability, and sustainable farming practices. <br />  <br />*Minimally Processed. No Artificial Ingredients <br /><br /> ",
    "link": "https://www.marxfoods.com/Le-Qubcois-Grain-fed-Veal-Frenched-Rib-Chops",
    "image_link": "\r\n                https://www.marxfoods.com/images/Le-Qubcois-Grain-fed-Veal-Frenched-Rib-Chops_Grain-fedVealRibChops-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "7372",
    "title": "Le Quebecois Veal Top Rounds",
    "description": "The top round is the largest single muscle and most desirable cut in the veal leg. It can be  braised or roasted whole, but is often cut into veal scallops/cutlets. These top rounds have had the cap  muscle &amp;amp; membrane removed for your convenience.<br /> <br />Grain-fed veal is not  the same as ‘pale veal.’ Its natural rose color comes from a varied, nutritious diet, including grains,  which give the meat a more robust flavor for two reasons: First, grains give the meat subtle marbling  that infuses the meat with flavor and tenderness that veal is known for. Second, grain-fed veal contains  more iron and other minerals which add to the delicious flavor and the animal’s health. <br />  <br />Le Québécois is the first veal program to combine USDA approved All Natural* status, humane  animal husbandry, full traceability, and sustainable farming practices.<br /> <br />*Minimally  Processed. No Artificial Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Grain-Veal-Top-Rounds",
    "image_link": "https://www.marxfoods.com/images/Grain-Veal-Top-Rounds_Grain-fedVealTopRounds-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4780",
    "title": "Grain-fed Veal Whole Tenderloins",
    "description": "Whole veal tenderloins are usually sold cut into Grain-fed Veal Butt Tenders. and short  tenders. By buying whole tenderloins you are getting both cuts in one piece of meat. Veal tenderloins  are similar to beef tenderloins in that they are one of the animal’s most tender sections, but are  milder in flavor. Because of this, veal tenderloins are best suited to being served with sauces. <br  /> <br />Of course, being veal instead of beef, these tenderloins will be even more tender.  They have had their surface fat removed for your convenience.<br /> <br />Grain-fed veal is  not the same as ‘pale veal.’ Its natural rose color comes from a varied, nutritious diet, including  grains, which give the meat a more robust flavor for two reasons: First, grains give the meat subtle  marbling that infuses the meat with flavor and tenderness that veal is known for. Second, grain-fed veal  contains more iron and other minerals which add to the delicious flavor and the animal’s health. <br  /> <br />Le Québécois is the first veal program to combine USDA approved All Natural* status,  humane animal husbandry, full traceability, and sustainable farming practices.<br /> <br />*Minimally  Processed. No Artificial Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Grain-fed-Veal-Whole-Tenders",
    "image_link": "https://www.marxfoods.com/images/Grain-fed-Veal-Whole-Tenders_Grain-fedVealTenderloins-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4827",
    "title": "Grain-fed Veal Butt Tenders",
    "description": "Though the term “butt” when referring to meat tends to evoke the upper part of pork shoulder,  a fatty part of the animal, veal butt tenders are actually very different and quite lean. <br />  <br />Traditionally veal tenderloins, the muscles on a cow that perhaps do the least amount of  work, are divided into two sections: the smaller forward “short” and the larger rear “butt.” Because of  the small amount of work during the animal’s lifetime, the tenderloin remains tender despite being  extremely lean.<br /> <br />Ideal for being cut into veal medallions, meat from the butt  tender is a great way to showcase sauces.<br /> <br />Grain-fed veal is not the same as  ‘pale veal.’ Its natural rose color comes from a varied, nutritious diet, including grains, which give  the meat a more robust flavor for two reasons: First, grains give the meat subtle marbling that infuses  the meat with flavor and tenderness that veal is known for. Second, grain-fed veal contains more iron  and other minerals which add to the delicious flavor and the animal’s health. <br /> <br />Le  Québécois is the first veal program to combine USDA approved All Natural* status, humane animal  husbandry, full traceability, and sustainable farming practices. <br /><br /> <br />*Minimally  Processed(more...) ",
    "link": "https://www.marxfoods.com/Veal-Butt-Tenders",
    "image_link": "https://www.marxfoods.com/images/Veal-Butt-Tenders_Grain-fedVealButtTenders-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "7370",
    "title": "Le Quebecois Veal Striploins",
    "description": "In beef, striploins are the cut where NY strip steaks come from, but in veal the striploin  can be cut into tender, flavorful cutlets, chops, or medallions. They can also be roasted whole and  carved at the table.<br /> <br />Grain-fed veal is not the same as ‘pale veal.’ Its natural  rose color comes from a varied, nutritious diet, including grains, which give the meat a more robust  flavor for two reasons: First, grains give the meat subtle marbling that infuses the meat with flavor  and tenderness that veal is known for. Second, grain-fed veal contains more iron and other minerals  which add to the delicious flavor and the animal’s health. <br /> <br />Le Québécois is the  first veal program to combine USDA approved All Natural* status, humane animal husbandry, full  traceability, and sustainable farming practices.<br /> <br />*Minimally Processed. No  Artificial Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Grain-Veal-Striploins",
    "image_link": "https://www.marxfoods.com/images/Grain-Veal-Striploins_Grain-fedVealStriploins-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3977",
    "title": "Grain-fed Veal Porterhouse Chops",
    "description": "Porterhouse chops are cut from either the short loin or block ready loin. The porterhouse  chop is similar to the t-bone, with a long bone running through the middle with the tenderloin on one  side and the strip loin on the other.&amp;nbsp; You&#x27;re essentially enjoying two steaks in one: a  portion of tender filet mignon and a portion of NY strip steak.<br /> <br />These veal  porterhouse&amp;nbsp;steaks tend to average between 1 1/4&quot; and 1 1/2&quot;&amp;nbsp;thick.&amp;nbsp;  However, they are portioned by weight rather than thickness, so this can vary.<br /> <br />Grain-fed  veal is not the same as ‘pale veal.’ Its natural rose color comes from a varied, nutritious diet,  including grains, which give the meat a more robust flavor for two reasons: First, grains give the meat  subtle marbling that infuses the meat with flavor and tenderness that veal is known for. Second,  grain-fed veal contains more iron and other minerals which add to the delicious flavor and the animal’s  health. <br /> <br />Le Québécois is the first veal program to combine USDA approved All  Natural* status, humane animal husbandry, full traceability, and sustainable farming practices. <br />  <br />*Minimally Processed. No Artificial Ingredients <br /><br /> ",
    "link": "https://www.marxfoods.com/Le-Quebecois-Grain-fed-Veal-16oz-Porterhouse-Chops",
    "image_link": "\r\n                https://www.marxfoods.com/images/Le-Quebecois-Grain-fed-Veal-16oz-Porterhouse-Chops_Grain-fedVealPorterhouseChops-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4068",
    "title": "Grain-fed Veal Bone-in Short Ribs",
    "description": "Grain-fed veal short ribs are an often overlooked cut with excellent flavor that is perfect  for slow-cooked, old-school comfort food. Short-ribs are cut in a rectangular shape containing rib bones  from the forequarter. <br /> <br />Grain-fed veal is not the same as ‘pale veal.’ Its  natural rose color comes from a varied, nutritious diet, including grains, which give the meat a more  robust flavor for two reasons: First, grains give the meat subtle marbling that infuses the meat with  flavor and tenderness that veal is known for. Second, grain-fed veal contains more iron and other  minerals which add to the delicious flavor and the animal’s health. <br /> <br />Le  Québécois is the first veal program to combine USDA approved All Natural* status, humane animal  husbandry, full traceability, and sustainable farming practices. <br /> <br />*Minimally  Processed. No Artificial Ingredients <br /><br /> ",
    "link": "https://www.marxfoods.com/Grain-fed-Veal-Bone-in-Short-Ribs",
    "image_link": "\r\n                https://www.marxfoods.com/images/Grain-fed-Veal-Bone-in-Short-Ribs_Grain-fedVealShortRibs-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4825",
    "title": "Le Quebecois Grain-fed Veal Cheeks",
    "description": "While not having as robust a flavor as beef cheeks, veal cheeks are considerably more tender.  Cheek meat excels in moist, slow cooking applications where the collagen can break down into gelatin  &amp;amp; the meat becomes fork-tender. <br /> <br />Grain-fed veal is not the same as ‘pale  veal.’ Its natural rose color comes from a varied, nutritious diet, including grains, which give the  meat a more robust flavor for two reasons: First, grains give the meat subtle marbling that infuses the  meat with flavor and tenderness that veal is known for. Second, grain-fed veal contains more iron and  other minerals which add to the delicious flavor and the animal’s health. <br /> <br />Le  Québécois is the first veal program to combine USDA approved All Natural* status, humane animal  husbandry, full traceability, and sustainable farming practices. <br /> <br />*Minimally  Processed. No Artificial Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Grain-fed-Veal-Cheek-Meat",
    "image_link": "https://www.marxfoods.com/images/Grain-fed-Veal-Cheek-Meat_Grain-fedVealCheekMeat-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4824",
    "title": "Grain-fed Veal Liver Slices",
    "description": "Calf’s liver is considered the finest of the red-meat livers available because of its smooth  texture and mild flavor. As the liver is usually the organ where toxins and chemicals are stored, Le  Québécois veal’s all natural status is particularly important when considering this product. <br />  <br />Grain-fed veal is not the same as ‘pale veal.’ Its natural rose color comes from a varied,  nutritious diet, including grains, which give the meat a more robust flavor for two reasons: First,  grains give the meat subtle marbling that infuses the meat with flavor and tenderness that veal is known  for. Second, grain-fed veal contains more iron and other minerals which add to the delicious flavor and  the animal’s health.<br /> <br />Le Québécois is the first veal program to combine USDA  approved All Natural* status, humane animal husbandry, full traceability, and sustainable farming  practices. <br /> <br />*Minimally Processed. No Artificial Ingredients<br /><br /> ",
    "link": "https://www.marxfoods.com/Grain-fed-Veal-Liver",
    "image_link": "https://www.marxfoods.com/images/Grain-fed-Veal-Liver_Grain-fedVealLiverSlices-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2241",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4705",
    "title": "Venison Stew Meat",
    "description": "Venison stew meat is a mix of pre-cubed solid deer meat.&amp;nbsp; Though not suitable for  grilling or sautéing, it is one of the most affordable ways to enjoy venison and becomes very tender and  flavorful when slow braised or stewed.<br /><br />Venison is lean, naturally tender and  darker than beef with a robust game flavor.&amp;nbsp; This stew meat can either be used in traditional  venison dishes (like stews) or as a lower-fat beef substitute in chilies, goulash, stroganoff, and a  host of other dishes.<br /><br />Of all farmed venison, New Zealand venison is particularly  prized because that country’s deer farms adhere to exceptionally high standards of husbandry.&amp;nbsp;  This stew meat is cut from New Zealand red deer.<br /> <br /><br /><br /> ",
    "link": "https://www.marxfoods.com/Venison-Stew-Meat_2",
    "image_link": "https://www.marxfoods.com/images/Venison-Stew-Meat_2_VenisonStewMeat-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "61",
    "shipping_weight": "1 lb"
  },
  {
    "id": "8502",
    "title": "Venison Boneless Shoulder",
    "description": "Because venison shoulder meat can&#x27;t be prepared using quick cooking techniques like  grilling or sauteing, it is much more affordable than popular cuts like racks and tenderloins.  However,  with a little patience and a slow, moist cooking method like stewing or braising, it  becomes delightfully tender and offers great flavor.<br /> <br />Alternatively, venison  shoulders can be cut into cubes and put through a meat grinder for use in burgers, sausages, meatballs  and other ground meat dishes that can be cooked quickly.<br /><br />Silver Fern Farms  Venison is 100% grass-fed &amp;amp; finished, raised free range on massive pastures in New Zealand. No  hormone or antibiotic growth promotants are ever used, and GMOs are illegal in New Zealand.<br />  <br />It has a luxuriously tender texture (apart from the braising cuts, which must be slow  cooked) and a sweet, robust flavor.<br /> <br />This farm raised venison is considered  amongst the finest in the world. It is much more tender than wild venison without its intensely gamey  flavor. The &quot;Cervena&quot; appellation includes controls to ensure only the finest quality is sold.<br  /> <br />Healthy &amp;amp; Exceptionally Lean<br /> Venison has extremely low levels of  fat - significantly less than skinless chicken. It is also lower in cholest(more...) ",
    "link": "https://www.marxfoods.com/Venison-Boneless-Shoulder",
    "image_link": "https://www.marxfoods.com/images/Venison-Boneless-Shoulder_VenisonBonelessShoulder-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2446",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4041",
    "title": "Venison 8-Rib Frenched Rack",
    "description": "Venison racks are one of the most desirable and elegant cuts because of their combination of  tender meat and a beautiful appearance on the plate.  These racks have been pre-frenched for your  convenience (the bones have been cleaned of connective tissue for a better presentation).<br />  <br />Silver Fern Farms Venison is 100% grass-fed &amp;amp; finished, raised free range on massive  pastures in New Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal  in New Zealand.<br /> <br />It has a luxuriously tender texture (apart from the braising  cuts, which must be slow cooked) and a sweet, robust flavor.<br /> <br />This farm raised  venison is considered amongst the finest in the world. It is much more tender than wild venison without  its intensely gamey flavor. The &quot;Cervena&quot; appellation includes controls to ensure only the  finest quality is sold.<br /> <br />Healthy &amp;amp; Exceptionally Lean<br /> Venison  has extremely low levels of fat - significantly less than skinless chicken. It is also lower in  cholesterol than beef or lamb, while being high in iron and zinc. What fat it has is good fat, with high  levels of healthy omega 3 fatty acids.<br /> <br /><br /><br /> <br /><br  /> <br /> ",
    "link": "https://www.marxfoods.com/Venison-8-Rib-Frenched-Rack_4",
    "image_link": "https://www.marxfoods.com/images/Venison-8-Rib-Frenched-Rack_4_VenisonRacks-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "61",
    "shipping_weight": "1 lb"
  },
  {
    "id": "8499",
    "title": "Venison Whole Loin",
    "description": "Whole venison loins (aka venison backstrap meat) include both ribeye and strip loin portions  of meat, allowing diners to enjoy both the more flavorful ribeye and the leaner, tender strip loin.   They make an excellent venison roast, but can also be cut into steaks or medallions.<br /> <br  />Silver Fern Farms Venison is 100% grass-fed &amp;amp; finished, raised free range on massive  pastures in New Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal  in New Zealand.<br /> <br />It has a luxuriously tender texture (apart from the braising  cuts, which must be slow cooked) and a sweet, robust flavor.<br /> <br />This farm raised  venison is considered amongst the finest in the world. It is much more tender than wild venison without  its intensely gamey flavor. The &quot;Cervena&quot; appellation includes controls to ensure only the  finest quality is sold.<br /> <br />Healthy &amp;amp; Exceptionally Lean<br /> Venison  (deer meat) has extremely low levels of fat - significantly less than skinless chicken. It is also lower  in cholesterol than beef or lamb, while being high in iron and zinc. What fat it has is good fat, with  high levels of healthy omega 3 fatty acids.<br /> <br /><br /><br /> <br /><br  /> <br /> ",
    "link": "https://www.marxfoods.com/Whole-Venison-Loins",
    "image_link": "https://www.marxfoods.com/images/Whole-Venison-Loins_VenisonWholeLoins-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2446",
    "shipping_weight": "1 lb"
  },
  {
    "id": "8500",
    "title": "Venison Striploin",
    "description": "Venison striploins (aka venison shortloins) are cut from the saddle (back) and are one of the  more tender cuts (though the smaller venison tenderloins are the most tender).  They are suitable for  roasting whole or slicing into individual steaks, noisettes (small steaks), or medallions.<br />  <br />These striploins have had their surface layer of silverskin removed for your convenience.   They&#x27;re ready to slice, sear, or roast right out of the package. <br /><br />Silver  Fern Farms Venison is 100% grass-fed &amp;amp; finished, raised free range on massive pastures in New  Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal in New Zealand.<br  /> <br />It has a luxuriously tender texture (apart from the braising cuts, which must be slow  cooked) and a sweet, robust flavor.<br /> <br />This farm raised venison is considered  amongst the finest in the world. It is much more tender than wild venison without its intensely gamey  flavor. The &quot;Cervena&quot; appellation includes controls to ensure only the finest quality is sold.<br  /> <br />Healthy &amp;amp; Exceptionally Lean<br /> Venison has extremely low levels of  fat - significantly less than skinless chicken. It is also lower in cholesterol than beef or lamb, while  being high in iron and zinc. What fat i(more...) ",
    "link": "https://www.marxfoods.com/Venison-Striploins",
    "image_link": "https://www.marxfoods.com/images/Venison-Striploins_VenisonStriploins-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2446",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4042",
    "title": "Venison Tenderloin",
    "description": "As with other animals, deer tenderloin muscles do the least amount of work during the  animal’s lifetime.  This means they’re the most tender cut available, with a buttery smooth texture.   Venison tenderloin is a very versatile, easy to prepare cut that can be roasted whole, sliced into  medallions, or finely minced for tartare<br /> <br />Silver Fern Farms Venison is 100%  grass-fed &amp;amp; finished, raised free range on massive pastures in New Zealand. No hormone or  antibiotic growth promotants are ever used, and GMOs are illegal in New Zealand.<br /> <br />It  has a luxuriously tender texture (apart from the braising cuts, which must be slow cooked) and a sweet,  robust flavor.<br /> <br />This farm raised venison is considered amongst the finest in the  world. It is much more tender than wild venison without its intensely gamey flavor. The &quot;Cervena&quot;  appellation includes controls to ensure only the finest quality is sold.<br /> <br />Healthy  &amp;amp; Exceptionally Lean<br /> Venison has extremely low levels of fat - significantly less  than skinless chicken. It is also lower in cholesterol than beef or lamb, while being high in iron and  zinc. What fat it has is good fat, with high levels of healthy omega 3 fatty acids.<br /> <br /><br  /><br /> <br /><br /> <br /> ",
    "link": "https://www.marxfoods.com/venison-tenderloin_2",
    "image_link": "https://www.marxfoods.com/images/venison-tenderloin_2_VenisonTenderloin-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "61",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4704",
    "title": "Venison Boneless Denver Leg",
    "description": "A Denver venison leg is all the muscles from a deboned deer hind leg that have been separated  &amp;amp; cleaned of surface membranes. First the leg is separated into the four sub-primals (rump,  knuckle, topside &amp;amp; silverside), then those sub-primals are split into the various muscles (1  rump, 3 knuckle, 2 topside, 2 silverside) for a total of eight individual pieces.<br /> <br />What  is surprising is that the quality of Silver Fern Farms venison is such that the cuts in the Denver leg  are tender enough to be used in applications typically reserved for more expensive cuts: steaks,  medallions, chateaubriand, etc.<br /> <br />Silver Fern Farms Venison is 100% grass-fed  &amp;amp; finished, raised free range on massive pastures in New Zealand. No hormone or antibiotic  growth promotants are ever used, and GMOs are illegal in New Zealand.<br /> <br />It has a  luxuriously tender texture (apart from the braising cuts, which must be slow cooked) and a sweet, robust  flavor.<br /> <br />This farm raised venison is considered amongst the finest in the world.  It is much more tender than wild venison without its intensely gamey flavor. The &quot;Cervena&quot;  appellation includes controls to ensure only the finest quality is sold.<br /> <br />Healthy  &amp;amp; Exceptionally Lean<br /> Venison has extreme(more...) ",
    "link": "https://www.marxfoods.com/Venison-Denver-Leg-2",
    "image_link": "https://www.marxfoods.com/images/Venison-Denver-Leg-2_VenisonDenverLeg-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "61",
    "shipping_weight": "1 lb"
  },
  {
    "id": "8501",
    "title": "Venison Flank Steaks",
    "description": "The flank steak is a thin steak with a pronounced grain cut from around the belly and most  often marinated before being either grilled or broiled.  Venison flank steaks can be prepared using  these traditional methods, but are also often braised because they’re so lean compared to beef.<br />  <br />Silver Fern Farms Venison is 100% grass-fed &amp;amp; finished, raised free range on massive  pastures in New Zealand. No hormone or antibiotic growth promotants are ever used, and GMOs are illegal  in New Zealand.<br /> <br />It has a luxuriously tender texture (apart from the braising  cuts, which must be slow cooked) and a sweet, robust flavor.<br /> <br />This farm raised  venison is considered amongst the finest in the world. It is much more tender than wild venison without  its intensely gamey flavor. The &quot;Cervena&quot; appellation includes controls to ensure only the  finest quality is sold.<br /> <br />Healthy &amp;amp; Exceptionally Lean<br /> Venison  has extremely low levels of fat - significantly less than skinless chicken. It is also lower in  cholesterol than beef or lamb, while being high in iron and zinc. What fat it has is good fat, with high  levels of healthy omega 3 fatty acids.<br /> <br /><br /><br /> <br /><br  /> <br /> ",
    "link": "https://www.marxfoods.com/Venison-Flanks",
    "image_link": "https://www.marxfoods.com/images/Venison-Flanks_VenisonFlankSteak-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2446",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4706",
    "title": "Venison Osso Bucco",
    "description": "Venison osso bucco is a low cost cut (relative to other parts of the deer) that consists of a  disc of meat &amp;amp; bone cut horizontally from the shank (leg). Because leg muscles do a lot of work  during the animal’s life time, shank meat offers great flavor but is too dense for fast cooking methods  like sautéing, frying, or grilling.<br /> <br />However, what makes osso bucco special is  that the shank and leg bone are naturally high in gelatin, perfect for slow braising in a flavorful  liquid. As the meat cooks it becomes rich and fork-tender, and all of that gelatin dissolves into the  sauce, giving it body and a silky, decadent mouth feel.<br /> <br />Although delicious year  round, braising cuts like osso bucco are a particularly good choice for shaking off winter chills and  doldrums.<br /> <br />Silver Fern Farms Venison is 100% grass-fed &amp;amp; finished, raised  free range on massive pastures in New Zealand. No hormone or antibiotic growth promotants are ever used,  and GMOs are illegal in New Zealand.<br /> <br />It has a luxuriously tender texture (apart  from the braising cuts, which must be slow cooked) and a sweet, robust flavor.<br /> <br />This  farm raised venison is considered amongst the finest in the world. It is much more tender than wild  venison without its in(more...) ",
    "link": "https://www.marxfoods.com/Venison-3-Hindshank-Osso-Bucco_4",
    "image_link": "https://www.marxfoods.com/images/Venison-3-Hindshank-Osso-Bucco_4_VenisonOssoBucco-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "61",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4796",
    "title": "Wild Boar Uncured Maple Slab Bacon",
    "description": "Wild boar is leaner and more flavorful than conventional pork, allowing for leaner bacon that  still possesses a strong flavor. Slab wild boar bacon allows you to cut your own strips of boar bacon as  thick or as thin as you want.<br /><br />Because wild boar bacon is so much leaner, it has a  different, meatier texture than conventional bacon.<br /> <br />Food &amp;amp; Wine Magazine  has called our wild boar “the ultimate sustainable meat” – read the full article.  Unlike much of the  Wild Boar on the market, ours isn’t farm-raised—it’s truly wild, trapped in the Texas Hill Country.<br  /> <br />Ingredients: Pork (Wild Boar), Water, Salt, Maple Syrup, Celery Powder, Spices. <br  /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Slab-Bacon",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Slab-Bacon_WildBoarSmokedSlabBacon-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2368",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26191",
    "title": "Wild Boar Boneless Leg",
    "description": "Wild boar leg muscles are used a lot during the animal’s life time, particularly on  wild-caught boar.  This makes their meat too tough for fast cooking methods like grilling, but it also  gives it incredibly rich flavor.  The solution is to use the meat in slower cooking methods such as  stewing, slow roasting, or braising which will tenderize it.<br /><br />These legs have had  their bones removed for your convenience, making them much easier to cut into stew meat cubes or carve  after roasting.<br /> <br />Food &amp;amp; Wine Magazine has called our wild boar “the  ultimate sustainable meat” – read the full article.  Unlike much of the wild boar on the market, ours  isn’t farm-raised—it’s truly wild, trapped in the Texas Hill Country.<br /> <br />The  wildness of true wild boar gives it a distinct game flavor that farm-raised wild boar simply cannot  match. Although similar to domestic pork and farm-raised wild boar, wild wild boar has a deeper color,  leaner texture, tighter grain, and bolder taste.<br /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Leg-Meat",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Leg-Meat_WildBoarLegMeat-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26171",
    "title": "Wild Boar Bellies",
    "description": "Wild boar bellies are a fatty cut from the belly of the boar. Bellies (both pork bellies and  wild boar bellies) are returning to popularity because of their tremendous succulence when braised, slow  roasted or cured and smoked into bacon.<br /><br />Because of their genetics &amp;amp;  wild-ranging lifestyle, wild boar is naturally leaner than pork.  This extends to their belly meat as  well, which will have less fat than conventional pork bellies.<br /> <br />Food &amp;amp;  Wine Magazine has called our wild boar “the ultimate sustainable meat” – read the full article.  Unlike  much of the Wild Boar on the market, ours isn’t farm-raised—it’s truly wild, trapped in the Texas Hill  Country.<br /> <br />The wildness of true Wild Boar meat gives it a distinct game flavor  that farm-raised Wild Boar simply cannot match. Although similar to domestic pork and farm-raised Wild  Boar, wild Wild Boar has a deeper color, leaner texture, tighter grain, and bolder taste. <br /><br  /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Bellies",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Bellies_WildBoarBellies-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26160",
    "title": "Ground Wild Boar",
    "description": "Replacing traditional ground pork with ground wild boar can greatly increase the flavor of  almost any dish. Wild Boar meat tastes slightly sweet and nutty due to its diet of foraged nuts and  other foods from the forest.<br /> <br />Food &amp;amp; Wine Magazine has called our wild  boar “the ultimate sustainable meat” – read the full article.  Unlike much of the Wild Boar on the  market, ours isn’t farm-raised—it’s truly wild, trapped in the Texas Hill Country.<br /> <br />Although  similar to domestic pork and farm-raised Wild Boar, our wild Wild Boar has a deeper color, leaner  texture, tighter grain, and bolder taste.<br /><br /> ",
    "link": "https://www.marxfoods.com/wild-boar-ground",
    "image_link": "https://www.marxfoods.com/images/wild-boar-ground_GroundWildBoar-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26174",
    "title": "Wild Boar St. Louis Spare Ribs",
    "description": "Wild boar spare ribs are tremendously juicy, tender and perfect for the grill. These are St.  Louis style spare ribs, meaning that the surrounding bones and cartilage have been removed to make them  easier to eat (and so you’re paying for less bone). <br /> <br />Food &amp;amp; Wine  Magazine has called our wild boar “the ultimate sustainable meat” – read the full article.  Unlike much  of the Wild Boar on the market, ours isn’t farm-raised—it’s truly wild, trapped in the Texas Hill  Country. <br /> <br />The wildness of true Wild Boar meat gives it a distinct game flavor  that farm-raised Wild Boar simply cannot match. Although similar to domestic pork and farm-raised Wild  Boar, wild Wild Boar has a deeper color, leaner texture, tighter grain, and bolder taste. <br /><br  /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-St-Louis-Spare-Ribs",
    "image_link": "\r\n                https://www.marxfoods.com/images/Wild-Boar-St-Louis-Spare-Ribs_WildBoarStLouisSpareRibs-1.jpg\r\n            ",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "8264",
    "title": "Wild Boar Boneless Neck",
    "description": "Boneless wild boar necks offer great flavor at a lower price than many of the more popular  cuts.&amp;nbsp; Though not suitable for fast cooking methods without grinding, they excel when  slow-braised or stewed.&amp;nbsp; They can also be ground for use in pasta sauces, burgers, meatballs  and more.<br /> <br />Food &amp;amp; Wine Magazine has called our wild boar “the ultimate  sustainable meat” – read the full article.&amp;nbsp; Unlike much of the wild boar on the market today,  ours isn’t farm-raised—it’s truly wild, trapped in the Texas Hill Country.<br /><br />The  wildness of true wild Boar gives it a distinct game flavor that farm-raised wild boar simply cannot  match. Although similar to domestic pork and farm-raised wild boar, wild wild boar has a deeper color,  leaner texture, tighter grain, and bolder taste.<br /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Necks",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Necks_WildBoarNecks-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3738",
    "title": "Wild Boar Tenderloin",
    "description": "Tender, easy to cook, and delicious, wild boar tenderloins are a great way to try this exotic  game meat for the first time. They&#x27;re delicious marinated, brined, or coated with a spice rub and  then grilled or roasted.<br /> <br />Wild boar&#x27;s flavor is slightly sweet and nutty  from its diet of foraged nuts and other foods from the forest. The tenderloin comes from the back of the  boar, running from the shoulder to the leg. Because the boar does not use these muscles very often, the  meat in wild boar tenderloins is very tender. <br /> <br />Food &amp;amp; Wine Magazine has  called our wild boar &quot;the ultimate sustainable meat&quot; – read the full article.  Unlike much of  the wild boar on the market, ours isn&#x27;t farm-raised—it&#x27;s truly wild, trapped in the Texas Hill  Country.<br /> <br />The wildness of true wild boar meat gives it a distinct game flavor  that farm-raised wild boar simply cannot match. Although similar to domestic pork and farm-raised wild  boar, wild wild boar has a deeper color, leaner texture, tighter grain, and bolder taste. <br /><br  /> ",
    "link": "https://www.marxfoods.com/wild-boar-whole-tenderloin",
    "image_link": "https://www.marxfoods.com/images/wild-boar-whole-tenderloin_WildBoarTenderloin-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3992",
    "title": "Wild Boar Boneless Shoulder",
    "description": "Wild Boar boneless shoulder has a sweet and nutty flavor and is perfect for hearty,  slow-cooked meals. Try using wild boar shoulders instead of conventional pork shoulders for braising  dishes.<br /> <br />Food &amp;amp; Wine Magazine has called our wild boar “the ultimate  sustainable meat” – read the full article.  Unlike much of the Wild Boar on the market, ours isn’t  farm-raised—it’s truly wild, trapped in the Texas Hill Country.<br /> <br />The wildness of  true Wild Boar meat gives it a distinct game flavor that farm-raised Wild Boar simply cannot match.  Although similar to domestic pork and farm-raised Wild Boar, wild Wild Boar has a deeper color, leaner  texture, tighter grain, and bolder taste. <br /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Boneless-Shoulder-1-box-approx-17lbs",
    "image_link": "\r\n                https://www.marxfoods.com/images/Wild-Boar-Boneless-Shoulder-1-box-approx-17lbs_WildBoarBonelessShoulder-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4836",
    "title": "Wild Boar Bone-In Leg",
    "description": "Wild Boar bone-in legs can be roasted whole and carved tableside to wow your guests. <br />  <br />Food &amp;amp; Wine Magazine has called our wild boar “the ultimate sustainable meat” – read  the full article.  Unlike much of the wild boar on the market, ours isn’t farm-raised—it’s truly wild,  trapped in the Texas Hill Country.<br /> <br />The wildness of true Wild Boar gives it a  distinct game flavor that farm-raised Wild Boar simply cannot match. Although similar to domestic pork  and farm-raised Wild Boar, wild Wild Boar has a deeper color, leaner texture, tighter grain, and bolder  taste. <br /><br /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Bone-In-Leg",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Bone-In-Leg_WildBoarBone-InLeg-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "26172",
    "title": "Wild Boar Stew Meat",
    "description": "Wild boar&#x27;s flavor is slightly sweet and nutty from its diet of foraged nuts and other  foods from the forest. Wild boar stew meat is a more affordable cut with rich flavor that becomes tender  and incredibly delicious when slow cooked in liquid. <br /> <br />Food &amp;amp; Wine  Magazine has called our wild boar “the ultimate sustainable meat” – read the full article.  Unlike much  of the wild boar on the market, ours isn’t farm-raised—it’s truly wild, trapped in the Texas Hill  Country. <br /> <br />The wildness of true wild boar meat gives it a distinct game flavor  that farm-raised wild boar simply cannot match. Although similar to domestic pork and farm-raised wild  boar, wild wild boar has a deeper color, leaner texture, tighter grain, and bolder taste.<br /><br  /> ",
    "link": "https://www.marxfoods.com/Wild-Boar-Stew-Meat",
    "image_link": "https://www.marxfoods.com/images/Wild-Boar-Stew-Meat_WildBoarStewMeat-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2456",
    "shipping_weight": "1 lb"
  },
  {
    "id": "13726",
    "title": "Pekin Duck Legs",
    "description": "Pekin ducks (aka Long Island ducklings) are the variety most Americans think of when they  think of duck meat.  Pekin duck meat tends to be milder than Muscovy or Moulard duck.<br /> <br  />Pekin duck legs have more robust flavor than the breasts, but need to be slow cooked for  tenderness.  They are frequently braised or slow-cooked in duck fat to produce duck confit.<br /><br  /> ",
    "link": "https://www.marxfoods.com/Pekin-Duck-Legs",
    "image_link": "https://www.marxfoods.com/images/Pekin-Duck-Legs_PekinDuckLegs-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2523",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25249",
    "title": "Pekin Duck Breasts",
    "description": "Pekin ducks (aka Long Island ducklings) are the variety most Americans think of when they  think of duck meat.  Pekin duck breasts are somewhat similar to chicken breasts in size and shape, with  a robust dark meat flavor and a layer or intensely tasty fat beneath their skin.<br /> <br />Duck  meat is beloved in Europe and China, and its full flavor can be paired with sweet, savory and spicy  ingredients.<br /><br /> ",
    "link": "https://www.marxfoods.com/Pekin-Boneless-Breasts",
    "image_link": "https://www.marxfoods.com/images/Pekin-Boneless-Breasts_PekinDuckBreasts-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2523",
    "shipping_weight": "1 lb"
  },
  {
    "id": "24885",
    "title": "Magret Duck Legs",
    "description": "Magret duck leg quarters (aka magret leg-thigh combos) each include both the leg and thigh  attached at the joint.  They are plump with a rich and distinctive flavor. They are well suited to slow  cooking techniques and are often slow roasted, braised, or cured &amp;amp; simmered in duck fat to make  duck confit.<br /><br />These duck legs are harvested from Moulard ducks (cross bred from  Muscovy and Pekin ducks) which are regarded on both sides of the Atlantic as being the domesticated  breed with the most flavor. Although they have more total fat than a Muscovy duck, under the fat layer  they are actually on the lean side, so care must be taken not to overcook Magret duck meat.<br />  <br />These duck legs have been air chilled, a method preferred by chefs because it better  preserves the bird’s flavor, lets the meat absorb marinades better, doesn’t add water weight, and is  more environmentally friendly (produces less contaminated water) than water chilling, which is used for  most poultry.<br /> <br />Duck is beloved in both Europe and China, and its full flavor can  be paired with sweet, savory and spicy ingredients.<br /><br /> ",
    "link": "https://www.marxfoods.com/Magret-Duck-Legs",
    "image_link": "https://www.marxfoods.com/images/Magret-Duck-Legs_MagretDuckLegs-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2523",
    "shipping_weight": "1 lb"
  },
  {
    "id": "14852",
    "title": "Grade C Foie Gras",
    "description": "Foie gras is grouped into three quality grades: A, B &amp;amp; C.  Grade C foie is the most  affordable, but is the lowest quality and typically only suitable for mousses, sauces, pate, emulsions  &amp;amp; terrines.  It is not recommended for slicing &amp;amp; searing.<br /><br /> ",
    "link": "https://www.marxfoods.com/Grade-C-Foie-Gras",
    "image_link": "https://www.marxfoods.com/images/Grade-C-Foie-Gras_GradeCFoieGras-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "88",
    "shipping_weight": "1 lb"
  },
  {
    "id": "14108",
    "title": "Grade A Foie Gras",
    "description": "Foie gras is grouped into three quality grades: A, B &amp;amp; C.  Of these Grade A is the  finest and perfectly suited to slicing &amp;amp; searing.<br /> <br />Duck foie gras is the  buttery, creamy, soft enlarged liver of a duck (typically the Moulard breed) that has been force fed  (gavage) a corn mash during the finishing period.  Gavage is an ancient technique dating back to the  Egyptian and Roman eras (when it was typically done with figs).  This process makes use of the birds’  natural ability to use their livers to store extra energy (before flying south for the winter).<br /><br  /> ",
    "link": "https://www.marxfoods.com/Grade-A-Foie-Gras",
    "image_link": "https://www.marxfoods.com/images/Grade-A-Foie-Gras_GradeAFoieGras-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "88",
    "shipping_weight": "1 lb"
  },
  {
    "id": "14857",
    "title": "Sliced Grade B Foie Gras",
    "description": "These pre-sliced, individually quick frozen (IQF) pieces of foie gras are extremely easy to  cook.  Simply sear slices, still frozen, over high heat, for about 2 minutes per side, then serve. <br  /> <br />Foie gras is grouped into three quality grades: A, B &amp;amp; C.  Grade B foie is not  as perfect as Grade A, with a softer texture, and may exhibit some light bruising.  It is also likely to  render out more fat when cooking than Grade A foie.<br /><br /> ",
    "link": "https://www.marxfoods.com/Sliced-Foie-Gras",
    "image_link": "https://www.marxfoods.com/images/Sliced-Foie-Gras_SlicedGradeBFoieGras-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "88",
    "shipping_weight": "1 lb"
  },
  {
    "id": "5305",
    "title": "French Poulet Rouge™ Chicken",
    "description": "Poulet Rouge™ chickens (aka redbro cou nu chicken) are a venerable heritage breed renowned  for their flavor and their thin skin. Heritage poultry breeds are slower growing than conventional  chicken, resulting in a far more delicious bird.<br /><br />These Poulet Rouge™ chickens are  raised in North Carolina from Label Rouge breeding stock imported from France.  They are fed a strict  vegetarian, all-grain diet free from animal byproducts.  They live on small family farms in open-sided  houses with sunlight, natural ventilation, and access to the outdoors.<br /><br />The shape  of a Poulet Rouge™ is significantly different from the chickens you see at the grocery store. Their  bodies (and thus their breast meat) and legs are longer and less pudgy.  They’re leaner and have a  richer, fuller flavor.<br /><br />These birds are hand inspected, selected for premium  quality and hand processed before being air chilled. <br /><br />Air chilling (as opposed to  the cheaper and more common industrial water chilling) chickens is a more environmentally sound process  that generates less waste and further improves the flavor and texture of the bird (water chilled  chickens absorb undesirable water during the chilling process).<br /><br />Each Poulet  Rouge™ is large enough to prov(more...) ",
    "link": "https://www.marxfoods.com/French-Naked-Neck-Chicken",
    "image_link": "https://www.marxfoods.com/images/French-Naked-Neck-Chicken_WholeFrenchNakedNeckChicken-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "7761",
    "shipping_weight": "1 lb"
  },
  {
    "id": "25250",
    "title": "Whole Quail",
    "description": "Quail’s light colored meat is tender and succulent with a delicate, sweet and distinctly  nutty flavor. The smallest of the game birds, a common single serving of quail is two whole birds. Easy  to grill or roast whole, they can also be braised, sautéed, or stuffed. They look beautiful on the  plate.<br /> <br />Quail meat is enjoyed in a host of European, Middle Eastern, and even  Southeast Asian cuisines, and pairs well with a variety of spices and flavors.<br /> <br />These  quail have been air chilled, a method preferred by chefs because it better preserves the bird’s flavor,  lets the meat absorb marinades better, doesn’t add water weight, and is more environmentally friendly  (produces less contaminated water) than water chilling, which is used for most poultry.<br /><br  /> ",
    "link": "https://www.marxfoods.com/quail-whole-royale",
    "image_link": "https://www.marxfoods.com/images/quail-whole-royale_WholeQuail-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2470",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22508",
    "title": "Boneless Quail Breasts",
    "description": "Quail’s light colored meat is tender and succulent with a delicate, sweet and distinctly  nutty flavor. These boneless quail breasts (aka quail breast filets) are easy to cook and easier to eat  than whole quail. <br /> <br />Quail meat is enjoyed in a host of European, Middle Eastern,  and even Southeast Asian cuisines, and pairs well with a variety of spices and flavors. <br />  <br />These quail have been air chilled, a method preferred by chefs because it better preserves  the bird’s flavor, lets the meat absorb marinades better, doesn’t add water weight, and is more  environmentally friendly (produces less contaminated water) than water chilling, which is used for most  poultry.<br /><br /> ",
    "link": "https://www.marxfoods.com/Boneless-Quail-Breasts",
    "image_link": "https://www.marxfoods.com/images/Boneless-Quail-Breasts_BonelessQuailBreasts-1.jpg\r\n            ",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2470",
    "shipping_weight": "1 lb"
  },
  {
    "id": "22510",
    "title": "Frenched Quail Legs",
    "description": "These Frenched quail legs (aka “lollipop quail legs” or “quail tulips”) have had their bones  scraped clean down to the bunched leg meat, giving them a unique presentation and a natural handle.   Each leg has a single bite’s worth of meat.  They’re perfect for appetizers or hors d’oeuvres and are  often fried &amp;amp; served similarly to chicken wings. <br /> <br />Quail’s light colored  meat is tender and succulent with a delicate, sweet and distinctly nutty flavor. <br /> <br />Quail  meat is enjoyed in a host of European, Middle Eastern, and even Southeast Asian cuisines, and pairs well  with a variety of spices and flavors. <br /> <br />These quail have been air chilled, a  method preferred by chefs because it better preserves the bird’s flavor, lets the meat absorb marinades  better, doesn’t add water weight, and is more environmentally friendly (produces less contaminated  water) than water chilling, which is used for most poultry.<br /><br /> ",
    "link": "https://www.marxfoods.com/Frenched-Quail-Legs",
    "image_link": "https://www.marxfoods.com/images/Frenched-Quail-Legs_FrenchedQuailLegs-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "2470",
    "shipping_weight": "1 lb"
  },
  {
    "id": "5306",
    "title": "Quail Eggs",
    "description": "Quail eggs are small and have large brown specks on their shells. Most commonly found fried  sunny-side-up, pickled or hard-boiled, they are often used to add richness and pump up the presentation  of fine-dining dishes. Their flavor is similar to chicken eggs.<br /><br /> ",
    "link": "https://www.marxfoods.com/Quail-Eggs",
    "image_link": "https://www.marxfoods.com/images/Quail-Eggs_Quail-Eggs-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "48",
    "shipping_weight": "1.5 lb"
  },
  {
    "id": "3763",
    "title": "Whole Squab",
    "description": "Yes, squabs are young pigeons (called pigeonneaux in French). But this noble bird is too  often dismissed because it shares a name with the pests we see in metropolitan areas. Squab raised for  human consumption are brought up on farms, as they have been in the Middle East and Asia for ages (squab  were among the first birds domesticated). This practice has survived since antiquity because of these  birds’ delicious flavor.<br /> <br />Squab meat is dark - closer in flavor to duck than  chicken.&amp;nbsp; In addition to being flavorful, it&#x27;s tender, high in protein, and low in fat.&amp;nbsp;  Squabs are delicious sauteed,&amp;nbsp;roasted or grilled. These birds are already dressed, saving you  the hassle.<br /><br /> ",
    "link": "https://www.marxfoods.com/squab-whole-oven-ready",
    "image_link": "https://www.marxfoods.com/images/squab-whole-oven-ready_WholeSquab-1.jpg",
    "availability": "out of stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "52",
    "shipping_weight": "1 lb"
  },
  {
    "id": "3764",
    "title": "Partially Boned Squab",
    "description": "Partially boned squab (aka European style squab) has its torso bones removed, but the bird is  still whole. The de-boning makes it easier to have stuffed squab without having to work around the  bones.<br /> <br />Squabs are young pigeons (called pigeonneaux in French), but this noble  bird is too often dismissed because it shares a name with the pests we see in metropolitan areas. Squab  raised for human consumption are brought up on farms, as they have been in the Middle East and Asia for  ages (squab were among the first birds domesticated). This practice has survived since antiquity because  of these birds’ delicious flavor.<br /> <br />Squab meat is dark - closer in flavor to duck  than chicken.  In addition to being flavorful, it&#x27;s tender, high in protein, and low in fat.   Squabs are delicious sauteed, roasted or grilled. Our squab is fed a vegetarian diet and fresh spring  water. No antibiotics or chemicals are used. <br /> <br />Whole bone-in squabs are also  available.<br /><br /> ",
    "link": "https://www.marxfoods.com/squab-partially-boned",
    "image_link": "https://www.marxfoods.com/images/squab-partially-boned_Semi-BonelessSquab-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "52",
    "shipping_weight": "1 lb"
  },
  {
    "id": "4375",
    "title": "12 Variety Sausage Sampler",
    "description": "This sausage sampler is a great option for sausage lovers who want to try it all. It includes  four links of each of the following: <br /> Venison Sausage with Merlot &amp;amp; Blueberries<br  /> Lamb Merguez <br /> Buffalo Sausage with Chipotle Chilies <br /> Duck Sausage with  Orange Liquor<br /> Rabbit Sausage with White Wine <br /> Wild Boar Sausage with Cranberries  &amp;amp; Shiraz<br /> Smoked Duck Sausage with Apple Brandy<br /> Elk with Pear &amp;amp;  Port Wine<br /> Pheasant Cognac<br /> Wild Boar with Roasted Garlic &amp;amp; Marsala<br  /> Venison with Red Wine &amp;amp; Demi Glace<br /> Duck with Foie Gras<br /> <br />Please  keep in mind that if we run out of a particular variety, it may be substituted with a sausage not listed  here. Generally we are able to supply the sausages on this list.<br /> <br />INGREDIENTS BY  SAUSAGE VARIETY:<br />Venison Sausage w/ Merlot &amp;amp; Blueberries: Venison, Pork, Beef, Water,  Potatoes, Salt, Carrot Powder (Carrot and 2% Silicone Dioxide), Sugar, Merlot Wine (Contains Sulfiting  Agents), Spices And Spice Extracts (Contains Canola Oil), Dried Blueberries (Blueberries, High Fructose  Corn Syrup And/Or Sugar, Sunflower Oil), Mustard Powder, Ground Chili Powder, Herbes de Provence  (Lavender, Spices, Canola Oil), Onion Powder, Garlic Powder, Flavorings, D(more...) ",
    "link": "https://www.marxfoods.com/sausage-sampler",
    "image_link": "https://www.marxfoods.com/images/sausage-sampler_12VarietySausageSampler-1.jpg",
    "availability": "in stock",
    "google_product_category": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp;\r\n                Eggs &amp;gt; Meat\r\n            ",
    "product_type": "Food, Beverages &amp; Tobacco &amp;gt; Food Items &amp;gt; Meat, Seafood &amp; Eggs &amp;gt;\r\n                Meat\r\n            ",
    "item_group_id": "7909",
    "shipping_weight": "9 lb"
  }
]